{
    "Resolution to Address DDT Waste Dumping in the Ocean.": [
        "'speaker_0': 'Thank you very much. We are going to go ahead and here I am. 34 police have been requested here at home, 34 person.'",
        "'speaker_1': 'Item 34 Communication from Councilman Alston, Councilwoman Allen, Councilwoman Price and Council Member Rangle. Recommendation to request city attorney to draft a resolution calling on Congress and the EPA to take all measures necessary to prevent further harm from the DDT waste dumped in the waters between Long Beach and Santa Catalina Island and Support Assembly Joint Resolution two by'",
        "'speaker_1': 'Assembly Member Patrick O'Donnell.'",
        "'speaker_0': 'Catherine and.'",
        "'speaker_4': 'Thank you, Mr. Mayor. And first, I'd like to thank, obviously, my colleagues, council member Alan, because we have a prize in Your Honor for signing on to this. I think it's a very important item. For half a century, we've known about the harmful, harmful effects of dichloromethane or trichloroethylene, that is, DDT for short.'",
        "'speaker_4': 'It's a pesticide was banned in the United States in 1972. It caused significant environmental damage and harmed numerous wildlife and marine species, including our sea lions, brown pelicans, California condors, dolphins and other birds and fish. The nation's largest manufacturer of DDT was located in Los Angeles, and they disposed toxic waste throughout the sewage pipes that poured into'",
        "'speaker_4': 'the ocean, creating a Superfund site of contamination of the house Verde Peninsula coast. What wasn't known until recently was that the company, the dump, also dumped as many as half a million barrels of toxic waste from DDT into the waters between Long Beach and Catalina Island, creating a much greater environmental health hazard than previously was known.'",
        "'speaker_4': 'Our Assembly member, Patrick O'Donnell, has authored the Assembly Joint Resolution Number two, which is currently going through the legislature, calling on Congress and the EPA to take all measures necessary to protect our coastal resources. And since a Assemblymember O'Donnell has introduced that legislation.'",
        "'speaker_4': 'The L.A. County Board of Supervisors has also passed a motion by Supervisor Hahn calling on federal calling on the federal government to address this environmental hazard. As important as our coastal resources are, it is also important to lobby, adds its voice in support of Assemblymember O'Donnell's legislation, as well as the county's action, with our resolution calling on'",
        "'speaker_4': 'Congress and the EPA to take appropriate measures. Assembly Member O'Donnell, I understand, is signed up to speak on this item. So with the consent and okay from my colleagues and the mayor, I would like to see if we can go directly to public comment before we go behind the rail.'",
        "'speaker_4': 'Thank you. And I would obviously appreciate your support on this. I'm.'",
        "'speaker_0': 'Thank you. I do. Let me just go ahead. There's a motion and there's a second by Councilwoman Price to be here the second, and then we'll go to the assembly member. Is there anything you want to compliment, Price?'",
        "'speaker_2': 'Thank you, Mr. Mayor. I'm happy to sign on to this item. And I think Councilman Councilmen Austin and Assemblyman O'Donnell for bringing this to our attention, I read only recently became aware of these dumplings. And I guess just real quickly, I just wanted to ask staff, were they is this something that the city staff was already aware'",
        "'speaker_2': 'of and are we already working with our state, county, federal partners on this?'",
        "'speaker_6': 'Counselor, this is Tom. It's not something I'm immediately aware of. We also are getting educated. We'll be asking if anyone else in the organization's been a part of this and its potential that the port has been as well.'",
        "'speaker_6': 'They do a lot of work on this related to contaminated fish tissue and and soil samples.'",
        "'speaker_2': 'Okay. Thank you.'",
        "'speaker_0': 'Thank you. And then with that, Madam Clerk, can we go to open a public comment? I believe that we have as a member. O'DONNELL We can make some remarks. Assembly member Patrick O'Donnell. Please begin.'",
        "'speaker_3': 'Mr. Mayor, you can hear me correct?'",
        "'speaker_0': 'Yeah. We can hear you.'",
        "'speaker_3': 'Great. Great. Good evening, Mayor and council members. And thank you for the opportunity to participate in tonight's discussion regarding the dumping of DDT off our coast. And tonight is really a chance to further educate people I've even heard tonight not even know about this.'",
        "'speaker_3': 'Well, I didn't know about this either. I read about it in the paper. And so tonight, the good thing is that more people don't know that the bad thing is that it's out there. But as the representative for Long Beach, Signal Hill, San Pedro and Catalina Island, someone who cares greatly about our environment.'",
        "'speaker_3': 'I have authored Assembly Joint Resolution two, which calls upon the federal government, the Federal Department, the Federal Environmental Protection Agency and the US Congress to take all measures necessary to prevent further harm to our citizens, wildlife and natural resources by the DDT waste dumped in the waters near Catalina Island.'",
        "'speaker_3': 'DDT is bad stuff. And this situation needs rapid attention and has the potential to become what I call a huge, unnatural disaster, in that it is a disaster created by man and man must address it and fix it.'",
        "'speaker_3': 'In 2019, scientists from UC Santa Barbara discovered a long forgotten dumping ground for toxic waste produced as a byproduct of the DDT manufacturing process. A recent survey of the site discovered over 27,000 barrels of waste, with potentially thousands more buried beneath the sand on the ocean floor.'",
        "'speaker_3': 'The site has already gone. The site has already done untold damage to our oceans and threatens to do even more without swift action. And that's what we are calling for again this evening. Assembly joint resolution to calls upon our federal government to take all necessary steps to stop the harm the site continues to inflict on California's residents'",
        "'speaker_3': 'and wildlife. And I want to thank Council member Austin Councilmembers Alan Price and Turanga for supporting air to and requesting a resolution on behalf of the City of Long Beach in support of this measure, which is really intended to educate and activate educating more people every day we talk about this and ultimately taking action on this tragic'",
        "'speaker_3': 'situation. DDT is bad stuff. It's off our coast and we must act. And I thank you.'",
        "'speaker_0': 'Thank you so much, Amber, for your work on this. And I do have other members lined up to speak. Let me start with Councilmember Ringo.'",
        "'speaker_4': 'Thank you, Mayor. Basically, I just want to add my voice to this issue, to Xyrem. Basically, we also, as you know, I am a member of the California Coastal Commission and we discussed Assembly Member O'Donnell's bill, and the commission is in support of the bill.'",
        "'speaker_4': 'I think it's a very important item that we need to look at protecting our coast. And obviously we're also concerned that there may be other sites along the coast of Canada, in Ireland as well, that are not discovered at this point.'",
        "'speaker_4': 'So we need to basically look at not only this site, but also others as well. So I want to thank the Assembly member for presenting that bill that is very important to the California coast. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember. Councilman Allen.'",
        "'speaker_2': 'Yes. I thank you, Mayor, and also want to thank Councilmember Austin for bringing this item forward and for the opportunity to co-sponsor. I support this. This is an important item. I also want to thank Assembly Member O'Donnell for the resolution at the state level.'",
        "'speaker_2': 'I also know that Congress Member Lowenthal is doing what you can in Congress to advocate on our behalf as well the the health of our local environment, our residents and our visitors who enjoy swimming, water, sports, fishing and other ocean activities are really important to me.'",
        "'speaker_2': 'We need to know how this happened, and we need the EPA and the Congress just to step up and help us clean it up. So thank you so much. This is important stuff.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilman's in the house.'",
        "'speaker_2': 'Thank you, Mayor. I just wanted to also thank Councilmember Alston for bringing this to council and of course, thank Assemblymember O'Donnell for his rapid attention to this matter and the urgency that he brings with it. And I fully support cleaning up this mess that we, you know, that just came upon us.'",
        "'speaker_2': 'And hopefully by doing this, we can capture other ones from happening in the near future.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Thank you. I just want to add also so my member, thank you for your leadership on this. This is actually a pretty big issue, I think, like you and so many others. When we start reading these reports of obviously something that's been some major reports on this in the news.'",
        "'speaker_0': 'It's pretty stunning what is actually just off our coast and certainly close to our neighbors in Catalina Island. The amount of damage it's happened to our coastal assets and marine life is significant. And this is obviously a very dangerous substance.'",
        "'speaker_0': 'And I think there's a lot of more work and research has got to be put in place to really understand how we really mitigate what's going on, but also protect ourselves from the future, from other types of incidents like this happening.'",
        "'speaker_0': 'And obviously, it's a different era today and there's many more protections. But I think having this conversation, this resolution and the conversation in the legislature is really important. So thank you, Assemblymember. And with that, I'm going to go ahead and go to a roll call vote, Madam Court.'",
        "'speaker_1': 'Councilwoman had. Actually.'",
        "'speaker_0': 'I think Councilmember Ashton I think I had him cued up one more time.'",
        "'speaker_4': 'Actually, I wasn't cued up again, but I want to just thank everybody for their comments and thank again our assembly member O'Donnell, for his work in the legislature around this. And again, this is one of those major issues that we need to be very mindful of and look forward to our anni vote.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you. With that, please, we'll cover.'",
        "'speaker_1': 'Compliments that they have. I'm Councilwoman Ellen.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Councilwoman Price, I. Councilman Sabina.'",
        "'speaker_3': 'My I.'",
        "'speaker_1': 'A woman mango.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Councilwoman Sara. I council member oranga i. Councilman austin.'",
        "'speaker_3': 'Hi.'",
        "'speaker_1': 'Vice Mayor Richardson.'",
        "'speaker_3': 'Yes.'",
        "'speaker_1': 'In case.'"
    ],
    "Plan for Parklets and Outdoor Dining Spaces Beyond June 2021.": [
        "'speaker_0': 'Thank you. We're going to go ahead and do item 23, please.'",
        "'speaker_1': 'Item 23 Communication from Mia Garcia, Councilwoman Allen. Councilwoman Mango Councilman Austin and Vice Mayor Richardson. Recommendation to request City Manager to develop a plan to allow restaurant and other related service industry parklets and outdoor dining spaces to remain open beyond June 30th, 2021.'",
        "'speaker_0': 'Thank you. I'm going to go ahead and start. And I want to first just especially thank Councilman Allen, Councilman Mongo, Councilman Austin and Vice Mayor Richardson for co-sponsoring the legislation that we have in front of us. And more broadly speaking, of course, other members of the council that have been very supportive of our open streets as well'",
        "'speaker_0': 'as our broader parklet outdoor dining program. What I really wanted to bring forward was we all know that the city, a date for the end of our current program is weeks away. So towards the end of next month, what we have in front of us, I think we all are aware, is a wildly successful outdoor dining program'",
        "'speaker_0': 'has been implemented across the city early on when the pandemic hit and there was an opportunity to do the outdoor dining. This council stepped right in and did the right thing and really providing a lifeline for restaurants to be able to operate outdoors in a way that was safe.'",
        "'speaker_0': 'And they would also bring in folks so that they felt comfortable eating and spending their time. And the resources at these restaurants. And the economic impact to restaurants has been devastating. I think we all know that there has been a huge amount of loss for all of our restaurants.'",
        "'speaker_0': 'Our restaurants and our food and beverage economy is one of the strong, strongest in our city. And I think all of us know also so many servers and cooks and restaurant restauranteurs that make up our community. And many of them, of course, live in our neighborhoods as we kind of pull out of this pandemic.'",
        "'speaker_0': 'We still have a lot of folks that feel more comfortable eating outside, regardless of the ability of restaurants being open. I know folks that will not eat indoors right now. They still want to eat outdoors. And I know that a lot of folks feel that for them that's what works.'",
        "'speaker_0': 'And in addition to that, I have talked to countless residents. Endless residents that stop me and say, we love the outdoor patios, please keep them. I discovered restaurants that I never had discovered before. I'll just give one example.'",
        "'speaker_0': 'I think all of us probably love five, five, five is one of the great steak houses and restaurants in our city. We talked to the managers there or some of the waitstaff. They'll tell you that they've they've brought in a whole new clientele and group of folks that had never been to the restaurant inside.'",
        "'speaker_0': 'But because they have a strong outdoor options, they are now there and it's brought in a different group of people to enjoy that place. And that's happening in restaurants all across the city. New folks are discovering restaurants because of the strengthened outdoor pilot program that we've had with with diners.'",
        "'speaker_0': 'Now, as a reminder. Parklets aren't new. In Long Beach, we had them before the pandemic. We didn't have as many as we have now, but they have been active and there is a parklet, permanent parklet process that the city has established for for restaurants or coffee shops to to build permanent parklets.'",
        "'speaker_0': 'And what I really want to make sure that we do with this motion is that first we have staff with the authority to provide a extension so that we have an extension beyond the June 30th date. And I've talked to staff and I'll share a question of time in a minute.'",
        "'speaker_0': 'Mr. MODICA What that could look like and then as an extension is put in place, is really create a more permanent process for the parklets that once they permit and to be clear, not every parklet once one wants to stay permanent and not every parklet may work in the locations that they're in.'",
        "'speaker_0': 'There's some traffic concerns there. It needs to be conversations with the bid's, with the neighborhoods. So we understand that there has to be a process in place. But my personal opinion is that as many parklets that want to stay permanent should be allowed to stay in place.'",
        "'speaker_0': 'And of course, we I think they have been a huge benefit to the residents and those businesses. And so I would love to see staff work with these restaurant owners directly and ensure that we're able to keep as many of these as possible.'",
        "'speaker_0': 'Now, separate of that, we also have an Open Streets program, and we know that many of these open street programs are when the closure of the streets are, many of those will probably will likely end at some point in the future.'",
        "'speaker_0': 'And I've heard from some from a lot of restaurant owners that they're ready to reopen their street. And but but some want to keep a parklet or want to expand their sidewalk dining. And so as part of this motion, I think we obviously want to we want to treat each parklet as an individual a request.'",
        "'speaker_0': 'So we want staff to go to each to talk to each park, look at what may work in one place, may not work in another. We want to make sure that we're also looking at creative options. It's parklet.'",
        "'speaker_0': 'Maybe some folks want to do an extension of the sidewalk dining. I've seen some restaurants in Bixby Nose and in downtown where they just been able to add a few more chairs or tables outside on the street. That's giving them the ability to continue to continue on.'",
        "'speaker_0': 'We should be lenient and provide an additional space for those folks to do those those types of of additional services on the sidewalk. And of course, I want to make sure that we're doing outreach to residents, to the beds, to the stakeholders so that we can have creative solutions.'",
        "'speaker_0': 'We want to have a process that is easy and that business owners feel comfortable going through and navigating so that we can hopefully make some of these permanent where it were. It may work to make them permanent. So Mr. Modica, with that, I might have some questions in a minute, but I do want to turn this over'",
        "'speaker_0': 'to some of the folks that have been in May the motion or report part of this process. So I have a motion by Councilwoman Allen. And with that, let me turn it over to her.'",
        "'speaker_2': 'Okay, great. Thank you, Mayor. And thank you for bringing this item forward or two. And also just for your leadership over the past year in supporting our businesses. I was so proud to sign on. I've heard from so many business owners and patrons about how much they love the parklets, just like so many of you.'",
        "'speaker_2': 'They absolutely love and I. And I love. I love it, too. I also want you to know that I have had the opportunity just to visit so many of these businesses, knocking on their doors and talking to them personally.'",
        "'speaker_2': 'And I just want to give a message to staff from now. I mean, they they thank you all so much. I mean, you created a lifeline for these businesses and some really tough days early in this pandemic. And this was a lifeline that they needed so desperately.'",
        "'speaker_2': 'You acted quickly and it served just such a great purpose. And you really helped their businesses and they were so grateful. So I just want to deliver that message to our two staff. And I also know that, you know, extending the parklets, you know, it gives it gives continues to give these businesses, you know, opportunity to recoup'",
        "'speaker_2': 'their losses. And for those that want to keep this permanent, it gives them an opportunity to get their application in. I think it's also important that we hear from our constituents and each of the neighborhood and the business districts and that we take into account, you know, all the safety considerations of our city engineer as we move'",
        "'speaker_2': 'from the temporary to the permanent parklets. And with regards to the open streets. I also talked to every single business I know online. And regarding that that that that closed street and the majority of those do want that open up again there.'",
        "'speaker_2': 'They're they're very grateful for the opportunity. But it's it's it's they they say they would like to see that opened up. I know I'm grateful that my partner, the DBA, is currently doing a survey for Open Streets. And so I think it's important that we listen to the stakeholders and their their opinion is going to be important'",
        "'speaker_2': '. And just working collaboratively and listening to our our constituents is as key. So thank you, Mayor, again, for for your leadership on this. I do have a question. So moving forward from the temporary parklets and as people make an application, there are going to be businesses that are not going to qualify for a permanent park.'",
        "'speaker_2': 'Parklet Is that correct?'",
        "'speaker_6': 'Yes. So we love the Parklet program. We think that is one of the shining examples of how this city and this council and mayor all reacted very quickly to support our businesses that we had dozens of them spring up literally within a week.'",
        "'speaker_6': 'Our staff were out there just creating these. But we also just put them in the places because the need was really to get people outdoors. In some areas, they are not. You know, there are some safety concerns. They may be over a storm drain, for example.'",
        "'speaker_6': 'They may be over a gas line. They may be in an area where the traffic engineer long term has some safety concerns. So we've informally looked at it. We think probably around 70% or more are eligible to go through the permanent process and have some modifications.'",
        "'speaker_6': 'But there are some that would not qualify and we would be working through those are looking at other options, maybe some sidewalk dining or other things that would be available.'",
        "'speaker_2': 'And one last question. So for those that do qualify, then they would have to follow the current design guidelines that are in place. And then I also want to ask you. So those guidelines that are in place as design guidelines, have those been updated or have any you know, we never expected to have these these parklets, but'",
        "'speaker_2': 'I'm glad we did and I love it. But are those going to be modified in any way or do they need to be?'",
        "'speaker_6': 'So Long Beach was one of the very first in the state of California to create Parklets for commercial use. The idea started in up in North in San Francisco as a parklet as a way to create open space, but not for any type of public use or private use like restaurants and things.'",
        "'speaker_6': 'Long Beach was one of the first to introduce that, and we started getting a number of people interested in 2018 after we had had a couple under our belt, couple of years under our belt, we decided to really create some very strong standards, design guidelines, a very easy to follow direction, directions on how you can create parklets'",
        "'speaker_6': '. So that is a pretty robust document that's available. We're willing to look at it if there's things that now don't make sense or have changed in COVID. But we think we have a really good foundation to work from right now.'",
        "'speaker_2': 'All right. Thank you very much.'",
        "'speaker_0': 'Thank you. And Mr. Monica, let's make sure as we start this program to review those that parklet can a process that we have the way to simplify it, we can we can do that the before I go to the seconder of the motion and then I want to go to public comment.'",
        "'speaker_0': 'And I have I would like to speak to Mr. Monica on the extension. I know I had asked you this, but what would your recommendation be for the extension as we work on this program?'",
        "'speaker_6': 'Yes. So I think we would recommend a three month extension beyond June 30th that we would get a through summer, which would be at the end of September. We would then during that time do lots of outreach. We'd go to the bids.'",
        "'speaker_6': 'We talked to everyone who's got a permit, and we would also then ask them to indicate whether they are interested in becoming permanent. They can apply right now if they want, but we realize a lot don't have the funding available or they need to recoup some losses.'",
        "'speaker_6': 'I do want to make sure, though, that we're heading people towards a permanent parklet, both for safety reasons but also for esthetic reasons. A lot of the ones that are out there right now are not. They were done on an emergency basis.'",
        "'speaker_6': 'They don't have the final materials. So we would want to do till September 30th. And if then we have people in the pipeline that are really working on getting it permanent, we'd be comfortable, you know, doing a transition as we move towards the permanent one and then sunsetting the ones that are not you're not interested in moving'",
        "'speaker_6': 'forward.'",
        "'speaker_0': 'Okay. So your recommendation would be the October one would be the end essentially of that of the of the extension. And then the goal would be, of course, to do a permanent process so that by then we've established this permanent process that folks have gone through, correct?'",
        "'speaker_6': 'Yes. So the permanent process exists now, but we would ask them to have filed everything to be working, or at least by October one, make significant progress towards making it permanent. And then, of course, if they need more time, we would work with them.'",
        "'speaker_0': 'And I want to make sure also, Mr. Modica, that it's not that we just don't treat this like any other part of the process, but we are. I mean, these folks have had dramatic impacts to their operations. And so I know we've had a lot of challenges in making sure that planning is is is up to speed'",
        "'speaker_0': 'and that we have our full development services team is at full speed. So I want to make sure that getting folks to permanency, which is certainly what I'd like to see and I think what you're hearing from probably here from council members should be prioritized so that these folks are, you know, come some time, you know, come'",
        "'speaker_0': 'September one, I'm going, oh my gosh, I've only got a few weeks to go and there's no one to help me or or I've been put, you know, to the bottom of some pile. And so I just want to make sure that we are kind of treating this as a very specialized program to get these folks to'",
        "'speaker_0': 'their permanent parklets, which I think have been a huge benefit to the city and to the restaurants. Let me go to the to the. So thank you for that. So I agree, Councilman Allen, I just part of the motion then will be that September, October I'm sorry, the October 1st and date.'",
        "'speaker_0': 'Are you okay with that? Councilman Allen?'",
        "'speaker_2': 'Yes, absolutely.'",
        "'speaker_0': 'Okay. Then the second of the motion is Vice Mayor Richardson.'",
        "'speaker_3': 'Thanks, Mr. Mayor. I'm in. I'll be brief. I think that you know what we what to in them present. It was actually an opportunity to double down on things we already committed to. It aligns with our vision for active transportation.'",
        "'speaker_3': 'It helps us reimagine our communities to have more walkable, vibrant communities while at the same time making businesses more vibrant. I'll give you an example. You know, we a years ago, we didn't have any businesses in my district with patio dining.'",
        "'speaker_3': 'And it took a lot major investments to get just one barbecue, extended the sidewalk. But just through this pandemic, what we saw was it became a matter of, you know, whether your business survives or not. And people came outside and they closed off their street and and it ended up being being a success.'",
        "'speaker_3': 'So I think that this is something that obviously I always will say we should defer to those local neighborhoods on what's right for them. But if there's a process that we can put in place that allows businesses and neighborhoods to accelerate their their path toward active transportation and other things in a more walkable community, I support that'",
        "'speaker_3': '. I see this as my my strong support to continue this. I think we also need to be thinking about people's tolerance for going indoors. Everyone has a different comfort level for how they reemerge into the reopening. And I think we just have to acknowledge that we've got to rethink open space in general curbs, sidewalks, bike lanes, all'",
        "'speaker_3': 'of those things. This isn't going to stop. We're going to have to start designing more patio dining, more use of the sidewalk, wider sidewalks, the things that we've been committed to. I think this is an opportunity to accelerate.'",
        "'speaker_3': 'So this this item, I was proud to sign on to it. Thank you, Mayor Garcia. And I know this is incredibly important to note that in many of our businesses, it's incredibly important. So I'm proud to add my name to this.'",
        "'speaker_3': 'Thanks.'",
        "'speaker_0': 'Thank you, Vice Mayor. Madam Court. We're going to go with that. I think we have a couple of public comment and then we'll go back to the council. And then we've got Councilman Austin when we come back. Alex Trebek.'",
        "'speaker_3': 'Please begin. Thank you, Mayor. Members of City Council Alex Charron, representing the Long Beach Restaurant Association. We sent a letter earlier voicing our strong support for the site, and we want to thank the mayor for his leadership and the council members for their engagement.'",
        "'speaker_3': 'Also want to thank very much John Kyser and the economic development team for engaging with the borough and our various members. All hundred plus are extremely supportive of the continuance of the park with the program. I think it's been an unintended consequence and benefit of the pandemic and I think the response from citizens throughout the city of'",
        "'speaker_3': 'Long Beach has been that they want to keep them as long as possible. We would offer selves up and our members obviously as a resource to city staff as they work through designing and implementing a final structure for the PARKLET program on a permanent basis.'",
        "'speaker_3': 'And again, thank you, Mayor, council members, city staff for your leadership, very strongly supportive on behalf of the library. Thank you. That concludes further comment.'",
        "'speaker_0': 'Thank you, Mr. Clarke. Come to more often.'",
        "'speaker_4': 'Thank you, Mr. Mayor. And I agree with all of the points that have been raised thus far. I want to give a special shout out. Thank you, obviously, to you, Mr. Mayor, for your leadership. But I want to thank the hardworking crews for our public works team who really have stepped up in action and made many of'",
        "'speaker_4': 'these open streets and parklet programs successful. I'm show that we are flexible, we are adaptable, and we can adjust for the moment. And it's really, I think, a credit to our city management or our public works department for really responding quickly.'",
        "'speaker_4': 'Now, I wish I know there are some businesses and folks in my community in Bixby, those who would have said the bit, but it should have gone a little bit quicker. But understanding the scope of the city, I think they did a really good job in responding to the moment.'",
        "'speaker_4': 'I'm going to speak in favor of this motion on this item. Certainly I will support extending and maintaining our parklets that are existing at least through the summer. We have great weather for outdoor dining and I think we need to smooth back into our reopening.'",
        "'speaker_4': 'And as somebody mentioned, be sensitive to the comfort levels of, you know, the consumers there. And then sidewalk dining, I think, is also very, very important to continue as well. And so I certainly hope this motion will contain that.'",
        "'speaker_4': 'I would like to if there's one thing that I've heard from my constituents in my businesses. Because that I think this open streets and parklets would even be more appealing if we were to to pay a lot more attention to the esthetics.'",
        "'speaker_4': 'Right. And so as we move forward, I think we're now beyond a temporary kind of solution we need. And those businesses that are looking toward permanence for parklets, there needs to be standards in place. But they have to look good, right?'",
        "'speaker_4': 'I think that's also important. It can't just be construction corrals and and, you know, orange and white. The corrals we want, we want we want we want the best. And we want our business districts. We want our our businesses to succeed.'",
        "'speaker_4': 'And the best way to do that is, is with the, I think, parklets and that look good signage that looks good. And so I would just ask that to think about the quality of these parklets what they look like and how they really, really complement the character of the business districts and communities in which they are in'",
        "'speaker_4': '. And, you know, I believe that these parklets should also be extended as a piece of regular operating business. Right. They should. As long as a restaurant is open, their parklets should be able to be operational as well. And so I would hope that we're considering giving that to consideration as well.'",
        "'speaker_4': 'And then I would just obviously announce it's been in the news. We had to make some some significant adjustments to improve traffic and mitigate traffic for Bixby nose area. We're going to go back to business as usual with that.'",
        "'speaker_4': 'But our parklets and sidewalk dining, I've heard overwhelmingly from our residents as well as our businesses that they want to keep that in place. And so I'm happy to support this and glad we're having this opportunity to extend this for our businesses that really need us at this point.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you, councilman. Councilman, Mango.'",
        "'speaker_2': 'Thank you, Mayor. I appreciate this item. I think it's a great direction. I completely agree that the esthetics are a huge component as we move forward. I think it's also important for us to be more strategic at the end of this.'",
        "'speaker_2': 'So two parts. One is, yes, it's important to prioritize this program. I think we should come in with a program that kind of has an open date for a window where we accept in all the applications and process them.'",
        "'speaker_2': 'But I think it's also really poignant that there are a lot of individuals in construction right now, whether they're doing home construction or commercial improvements that have been waiting 8 to 10 weeks to get their plans approved. And I appreciate Mr. Orsi is a.'",
        "'speaker_2': 'Extreme. Commitment to getting that timeline back in order. And I know we just started accepting people at City Hall this week, but I want to both prioritize this while not allowing for any additional delays on behalf of those that are waiting because type of message both for them and those that would like to get back to work'",
        "'speaker_2': '. There was a discussion about a roofing permit that was delayed for weeks. So I appreciate that the source is getting to that and I do want to prioritize this while also maintaining the progress that we've been making with the development services progress.'",
        "'speaker_2': 'Second, at the end of September 30th, when we have completed this project and we say everyone who's requested an outdoor space has received one. I think there's some value in going back to what Mr. Richardson said, which was there are areas across our city that could benefit from this that maybe didn't even realize it.'",
        "'speaker_2': 'And I'd love to see a strategy across the city, at least for an open parklet summer program in places that have not explored it before with landlords that have not seen this as an option. So I just want to put that in the ear of staff that as we move forward, we kind of think citywide about the'",
        "'speaker_2': 'opportunities available to us and as we make these big changes. So great item, great work and I look forward to seeing what comes of it.'",
        "'speaker_0': 'Thank you. The Councilwoman Price.'",
        "'speaker_2': 'Thank you, Mr. Mayor. And I appreciate that this item was brought forth, and I appreciate the opportunity to comment on it. I think that our temporary emergency PARKLET program has been very important in helping our local businesses during the intense difficulties of COVID 19.'",
        "'speaker_2': 'I think that the city demonstrated true leadership and in the urgency with which we implemented this program. And I think that's fantastic because I know there's numerous businesses that would have absolutely gone, gone bankrupt and not been able to function had we not been able to offer this alternative.'",
        "'speaker_2': 'I do think that as we're thinking about the city wide approach, we consider the various differences in our business corridors and the neighborhoods where parklets are present. And that's why the experiences of my colleagues who have parklets in residential neighborhoods has been particularly interesting to me.'",
        "'speaker_2': 'I've been talking with them about it because the impacts to some of the neighborhoods simply can't be mitigated where there are parklets available or currently in existence. And also in talking with our traffic engineer, there are significant issues with traffic safety.'",
        "'speaker_2': 'Not all of the streets in the city are the same with not all traffic speeds are the same, not all volume on the streets where parklets are the same, and all neighborhoods that have residents living close to Parklets will have some impacts to the community as a result.'",
        "'speaker_2': 'So I'd like to offer a friendly to Councilwoman Allen that this item and actually before I do that for clarification, would it be to extend whatever businesses are currently operating parklets until October.'",
        "'speaker_6': 'Yes. So we would recommend that we would extend what we call our entirety of our Open Streets program until October. And there is really three components to October Open Streets, there's the actual open street like Pine or Atlantic, and those are really governed by the businesses.'",
        "'speaker_6': 'If they you know, they're going through surveys right now and they man by Atlantic is going to be going back but and pine is under evaluation. There's then parklets and then there's the ops and I can talk about that a little bit more later, but we would imagine that all of those would be able to be extended'",
        "'speaker_6': 'through September 30th, ending October 1st.'",
        "'speaker_2': 'Okay. So my, my friendly would be to have that extension be customized kind of going on to the mayor's points based on the neighborhoods and the specific impacts to the neighborhoods. For example, some of the businesses that were given Parklets in Belmont sure aren't even restaurants.'",
        "'speaker_2': 'We have a realtor who was given a parklet, and that takes up 2 to 3 parking spots. So I want to make sure that we have an opportunity to reevaluate that before we automatically extend. And also, I want to have the opportunity to speak to our traffic engineer.'",
        "'speaker_2': 'So my understanding is that we've had five accidents, vehicle accidents into Parklets and two of those have been in Belmont Short. Thankfully, no one got hurt, but those collisions did take out two parklets completely. One of them was in front of the business I own on Second Street, so I want to make sure that the extension and'",
        "'speaker_2': 'any future PARKLET program be customized so that it's not a one size fits all for the entire city, and that we can look into things like traffic impacts and parking impacts. We've lost over 150 parking spots in Belmont Shaw, which is now presenting a major stress on the retail businesses there, as well as the residents.'",
        "'speaker_2': 'So like I said, some of those parklets aren't even restaurants and may not need to be a parklet and I don't want to have an automatic extension. So I'm I'm asking for some customization in that front. And so my motion was that everyone would automatically get an automatic extension.'",
        "'speaker_2': 'And then those they have the opportunity to apply for permanent and that would go to October. Okay. So my friendly would be that it wouldn't be an automatic extension that we'd have the opportunity to look at the impacts to different neighborhoods before an automatic extension is given.'",
        "'speaker_2': 'Yeah, I know. My motion is for an automatic extension. Okay. Then I'll make a substitute motion and request that we have some customization in regards to the extension program. Okay.'",
        "'speaker_0': 'Because the councilwoman. So just saw what's the substitute official even.'",
        "'speaker_2': 'The substitute motion is that in regards to the extension of the pilot or the extension of the emergency parklet program, that city staff be given the opportunity to work with individual council offices to determine which parklets are extended based on traffic concerns and parking impacts and other neighborhood impacts to that particular community.'",
        "'speaker_0': 'Okay. That's a substitute. Is there a second on the substitute?'",
        "'speaker_3': 'They're also second.'",
        "'speaker_0': 'It is the second by customer Superman. Let me keep going through the list of books. Councilman's and Dan's.'",
        "'speaker_2': 'Thank you, Mr. Mayor. I just wanted to thank you very, very much for bringing this item forward. I think that this has been a life saver for many of our businesses here, especially in my district. I also wanted to thank all of the businesses who have been thinking outside of the box as well and have been able'",
        "'speaker_2': 'to provide this kind of environment for their customers. I think that that was maybe a very risky, you know, call for them. But they but they actually did it. And I think that it speaks very highly of our city staff and the devotion that they have towards our businesses, especially our restaurants, during these very difficult times.'",
        "'speaker_2': 'I hope that this motion will will not only continue to expand the PARKLETS, but also expand opportunities for our outdoor dining. And as we move forward, I think that's very important. We we cannot diminish the role that they have played in allowing us to keep restaurants and service and be able to save not all jobs, but at'",
        "'speaker_2': 'least some jobs across our city, which is very important as a member of our downtown community. I can speak to the impact that they have had on the quality of life, and I just love the feeling of still being part of a vibrant, active city, even in the midst of such a difficult, challenging time.'",
        "'speaker_2': 'I know that there have been many challenges along the way, and especially as someone who uses a wheelchair, it's important to me that we continue to maintain access to our sidewalks and public right of way where parklets are being used.'",
        "'speaker_2': 'And with that said, I think that the extending this program through October 1st is the right thing to do and will give our parties the ability to plan for longer term and address the issues in ways that move us in a sustainable way for these restaurants.'",
        "'speaker_2': 'I know that I have spoken to a lot of business owners in my district that have invested in the Parklets and they have really, really enjoyed being able to welcome their customers in their parklets. And like it was said before, you said, Mr. Mayor, that it has also brought in additional customers that would never probably frequent that'",
        "'speaker_2': 'restaurant because it was outside. It gave them the opportunity. So I just want to say thank you for this. And I'm really, really excited because I do think that these parklets will definitely, you know, bring so much more to our to our city.'",
        "'speaker_2': 'The quality and safety and convenience for everyone is important, especially right now, as our businesses recover from this COVID pandemic. So we really need to focus on on helping them recover and succeed. But most importantly, we really need to help our small businesses, our restaurants thrive from here on out.'",
        "'speaker_2': 'So thank you.'",
        "'speaker_0': 'Thank you, Councilmember Supernova.'",
        "'speaker_3': 'Thank you. We have just a handful of parklets in the fourth Council District and actually two of them on the Anaheim corridor in this area, business district have closed down. They're ready to go back indoors and they volunteer literally to shut them down.'",
        "'speaker_3': 'My concern, my support for the second is that I'm not sure where stakeholders would have a voice if this is just automatically move forward where you get an extension of 90 days. I'm not sure if there's a process in place where some of the unintended consequences, there's a port or someplace that the public can take that maybe'",
        "'speaker_3': 'Mr. Modica has something in mind. If so, if he if he could explain that. So that that's the spirit of the the second and why I'm supporting it is that we need to have some some point other than specifically the council office because these parklets didn't go through the council office.'",
        "'speaker_3': 'They basically the application goes to special events and that's who administers all this. So. Mr. Modica, do you have any way that the stakeholders could either have a protest or at least voice the issues? And secondly, to Councilman Austin's point, I think esthetics are incredibly important on this.'",
        "'speaker_3': 'And but I would add that it has to be a balance, has to be esthetics, safety and ADA access or ADA compliance are the keys. Those three keys. Thank you.'",
        "'speaker_6': 'Thank you, Mr. Zubrin. Yes. Those are some good questions. I'll try to answer those. I think we definitely can build in some community outreach process. I think with extra time, that becomes a little bit more robust. So if we're looking and trying to make decisions by June 30th about who should get them and who shouldn't.'",
        "'speaker_6': 'That's only about six weeks away. Additionally, we would need some criteria for the second on how we determine when we come to June 30th who who stays and who gets the automatic extension. I think there's some very valid points that are being brought up by Councilmember Pryce about and especially in some of her areas, are those that's'",
        "'speaker_6': 'one of our more difficult areas to determine permanent parklets. To be able to really look at what would need to be permanent and the and the permanent impacts of that on parking, on residents, on retail and others. So if we were going to do the substitute, I would need a little bit more direction on how do we'",
        "'speaker_6': 'make the determination? Is it certain businesses on Second Street, is it all of them or are certain businesses citywide? Or we do the extension and then work on that through the permanent process.'",
        "'speaker_3': 'So just to complete my thought, so if we're not there, can't get there by June 30th, can we possibly agree to that? There will be some process in place where people can voice an opinion on these.'",
        "'speaker_6': 'Yes, we can certainly set up a process to do that. Again, the more time there is to create it and have them voice it when then we can, you know, look at that as as we move towards decisions, trying to do all of that by June 30th is going to end and allow enough time and then make'",
        "'speaker_6': 'those decisions on whether or not to extend them. That's a little tight in thinking.'",
        "'speaker_0': 'Thank you. Councilwoman Sara.'",
        "'speaker_2': 'Thank you, Mr. Mayor. I also want to thank your leadership on this item as well. I know our restaurant slash hospitality industry has been greatly impacted by COVID and has had to really pivot in order to survive. Many did not make it, including several restaurants and dining business did not survive in my district.'",
        "'speaker_2': 'But. But I wanted to ask the question, is this item also not us? Is this item to also vote for a plan for us in addition to extending it automatically until October? And then it's a plan to also determine how much it would cost to making a permit and what what the implication would be for it.'",
        "'speaker_2': 'Right.'",
        "'speaker_0': 'Yeah. I think I'm, I think I'll, I'll answer that. Mr. maybe Mr. Modica. I know we've been discussing this. The idea would be for staff to create a plan, and the extension would allow staff to create the plan to work with stakeholders, see which ones would work.'",
        "'speaker_0': 'And obviously if there were parklets that were going to try to apply to be permanent, but for whatever reason, maybe the traffic engineer or the community. There were issues with then, of course, then those parties perhaps would not be allowed to be permanent, depending on what that process was like.'",
        "'speaker_0': 'But this would just give everyone the time to, to and for staff the will to come up with that process, because there isn't one in place right now. Mr. Marchand, you want to add anything to that?'",
        "'speaker_6': 'Yes, I think that's exactly what we were looking to do, is to kind of create that and and then be able to gather all the input. So in terms of cost, though, this is typically a full cost recovery.'",
        "'speaker_6': 'We would expect that the city actually for a year now has been providing all of that for free. So we didn't charge fees. We provided all of the barricades on the public side when it was public access. So there's been a significant amount of public investment, but going forward, those would be cost recovery and the businesses would'",
        "'speaker_6': 'need to come up with the investment to make it permanent.'",
        "'speaker_2': 'And so with this also be a time where we could get the stakeholder. I heard a little bit that we would be able to get other input on on the development of this plan. Right, such as that, in reference to Council Member Sabrina's question about engaging feedback on this.'",
        "'speaker_6': 'Certainly, yes, we could set up a process to gather some more of that input, especially on the individual parklets. I know some of the bids are already doing that work up in Bixby Knolls on Atlantic. That work has already been completed.'",
        "'speaker_6': 'There's work right now going underway by the Dolby in downtown regarding Pine but also in general. And we would want time to assess that but also give people the ability to give input on a specific one that they might be having challenges with or that they really support.'",
        "'speaker_2': 'Okay. Thank you. That helps answer my question. And the other is that, you know, I, I also look at these parklet as opportunities for economic recovery and also activating our corridors. And it's one of the challenges I have and I look forward for opportunity to seeing how that could potentially work.'",
        "'speaker_2': 'And we developed plan in my district as well. So thank you so much.'",
        "'speaker_0': 'Thank you. Councilman's in Dallas.'",
        "'speaker_2': 'Thank you, Mayor. And thank you for everyone who's speaking on this as well. One of the things that I wanted to point out is thank you so much, Councilmember Sara, for pointing out that there actually have been a lot of businesses that have not survive.'",
        "'speaker_2': 'And that continues to break my heart every single day when I see businesses not being able to survive. So one of the things that I think is important is to make sure that we we tailored to those businesses that are really trying their best to to move forward and come out of this.'",
        "'speaker_2': 'So I would like to make subs to actually, you know, extend the, like the first motion. But maybe what we could do is only extended to the the restaurants that are currently on that on the PARKLET program. So I think that would be good in that way if it's only extended for the PARKLET.'",
        "'speaker_2': 'And like Councilmember Susie Price said, there's other businesses that maybe can can be looked at separately and that's what my set up would be.'",
        "'speaker_0': 'Okay. Is there a second on the sub?'",
        "'speaker_2': 'Sub again, Mr. Mayor?'",
        "'speaker_0': 'It's taken by Councilman Price. Councilmember.'",
        "'speaker_2': 'Councilman Price. You. And thank you, Councilwoman Zin de Haas. I'm just really trying to mitigate the impacts here, so I appreciate that said, I do I have a question for city staff. My district much of it and where I think most of the majority of the parklets in the city are in the coastal zone.'",
        "'speaker_2': 'Would an extension like this be automatic in the coastal zone?'",
        "'speaker_6': 'Development Services will help us with that.'",
        "'speaker_7': 'Uh, thank you. Councilwoman Price So depending on tonight's action, we would have those discussions with the Coastal Commission staff. Our current waiver from the Coastal Commission is based on the Governor's order. My understanding is that that order is going to lapse on June 15th, but we're not in possession of any subsequent order or clarifying language from the'",
        "'speaker_7': 'governor or from the legislature. So we can't predict exactly how the Coastal Commission will respond. But the Coastal Commission would be within their rights if they wished to to revoke our approval on June 16th.'",
        "'speaker_6': 'And just to add to that, if I will, there's still some lack of clarity there, because we do believe the governor is going to relax the health orders on June 15th, but we're believing that he'll keep the emergency in place through September because that's the federal funding to fund the disaster will go all the way through September'",
        "'speaker_6': '. So there may be some nuance there.'",
        "'speaker_2': 'Got it. Thank you. And Councilman Zander has the only friendly that I would make is when this comes back to us for a permanent parklet program that staff have the opportunity to consider safety issue, traffic safety issues, parking impacts, impacts on other businesses, not restaurants and residents input when considering whether to allow a parklet to go permanent'",
        "'speaker_2': '. Thank you. Send it. Thank you. And I appreciate that. And I just I do want to just I know. I hope Carl Hickman's on this call, Carl. The traffic safety concerns that you've that you and I have talked about is is it fair to say that the traffic safety concerns vary by street by street, depending on the'",
        "'speaker_2': 'with traffic volumes and speeds on the street?'",
        "'speaker_3': 'Yes, Councilwoman Price, you're exactly right. You know, not all the city's streets are the same. There are buried conditions everywhere. So Parklets in one district may not be the same as the perfect conditions in another. And the ones that are along Second Street and Belmont sure are rather unique.'",
        "'speaker_3': 'So you're right. We need to look at each individual roadway configuration where the parklets are and help to decide where we're going to allow them in the future to perhaps go to permanent or where they may be come out.'",
        "'speaker_2': 'Okay. Thank you. I appreciate that. And I'm going to vote in favor of the extension tonight. I can definitely hear where the votes are. Just want council members to understand. The reason I was asking for customization is I have some serious concerns about traffic safety issues and I wanted our traffic safety team to be involved with, even'",
        "'speaker_2': 'with the extension in terms of a few of the areas of concern. But I understand where the Council's will is, and I certainly am not going to vote against an item that will allow us to have the opportunity to continue to help our businesses.'",
        "'speaker_2': 'I just hope that those corrals are solidified and that everyone's taking the best precautions until we get through the extension. So thank you.'",
        "'speaker_0': 'Thank you, Councilwoman Councilman Mandel.'",
        "'speaker_2': 'Thank you. And I also think it is appropriate time to bring up an opinion that I know will not be popular among a majority of restaurant owners. But this particular restaurant owner contacted me because they feel as though stating their opinion is so unpopular that it is difficult for them to communicate in restaurant groups.'",
        "'speaker_2': 'There are restaurants in certain areas that have significantly more square footage than their neighbors. And so while they both benefit from the extension into a parklet like their neighbors do, the more parking spaces that are eliminated from the street also reduces the number of potential customers they feel that they can get.'",
        "'speaker_2': 'And again, we had some dialog about that. Customers aren't just based on parking, and there's a lot of other things going on in the economy. But I think with a long term vision of alternative modes of transportation to get to these corridors, I think that's really important because there are a lot of facilities that as the economy'",
        "'speaker_2': 'does reopen, the more parking spaces we take away in parking impacted neighborhoods, the more difficult it will be for them to return and restore to full capacity. And so how we adopt and bring in alternative modes of transportation to support those that pay.'",
        "'speaker_0': 'Top.'",
        "'speaker_2': 'Dollar for their space that now is not full and is also something for us to think about long term. So just as it's an opportunity to share their opinion that I think we are here to represent every voice and for those to be heard, I thought just an added to it, but I of course signed on to'",
        "'speaker_2': 'this item and support it wholeheartedly and just want to make sure that we move forward strategically in recognizing that. I hope that just months from now we will be completely restored and we want to make sure not to move in the direction of alternative transportation that the community has not yet adopted and look at what ways we'",
        "'speaker_2': 'can help them get there. Thank you.'",
        "'speaker_0': 'Thank you. Councilman Price.'",
        "'speaker_2': 'Thank you, Mr. Mayor. I also want to confirm one thing is that we're not going to be changing the operating hours at this time for the parklets. Again, I have homes that are located within 100 yards of bars and restaurants, and the operating hours that we've had in Belmont sure have seemed to work out okay.'",
        "'speaker_2': 'And so I just want to make sure we're not modifying that customization situation.'",
        "'speaker_0': 'Yeah, I think that's right. I mean. Mr. Monica, would it be would customization happen as they become permanent, passed past the the pilot or should?'",
        "'speaker_6': 'Yes, that is one area that we did have some customization. And most of the city we did just that with the normal operating hours due to the crowded conditions in Belmont Shore. We had worked on some other I think 10:00 was the it was kind of the consensus for for the Belmont Shore area.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'I think you have Councilman Allen.'",
        "'speaker_2': 'Yes. So I just wanted to talk on this really a little bit more. I understand what Councilman Price is, and the safety is always a concern for me. And I think that gives us time over until October to evaluate that.'",
        "'speaker_2': 'I will not support and I will not support only being restaurants. I know the restaurants had a hard time during the pandemic, but there are other businesses that were hit really hard that have parklets. In my district we have gyms, we have nail shops and I don't think I feel I don't support telling them that they don't'",
        "'speaker_2': 'have 90 days to to to recoup their their losses or even to go through the permanent process of having a permanent parklet. So I don't think that we should be should be telling businesses only restaurants are the only ones that have this this privilege.'",
        "'speaker_2': 'I think that some of the hardest hit businesses during the pandemic where the gyms, they weren't allowed to open at all where the nail shops and and so that's my concern. And I, I will not see I will not be supporting a motion just to allow only restaurants to have parklets.'",
        "'speaker_0': 'I'm wondering. Okay. SO Mr.. Mr.. Modica. I think the motion for the motion on the floor is an automatic extension for all restaurants and for non restaurants. Do we have an idea about how many parklets, how many non restaurant parklets there are or open space?'",
        "'speaker_0': 'I don't know.'",
        "'speaker_6': 'Mayor. The City Attorney. The motion on the floor is the substitute substitute which limits the Parklet extension to restaurants only.'",
        "'speaker_0': 'Right now. And my question to you, Mr. Modica, was how many of the current kind of parklets are non restaurants?'",
        "'speaker_6': 'Yeah, thank you for the question. So we believe there's about ten that are not either restaurants or bars. The vast majority are restaurants are parklets. There's a couple of bars. So that's a question for us, too. When you say restaurants, we're assuming you mean excluding bars, but that would be a clarity.'",
        "'speaker_6': 'And then there's a couple of barbers, salons and gyms within those ten. I do want to make clear, as I understand, you're talking about the Parklet program, not including those things. There are probably over 200 other businesses that have applied for what we call an occasional event permit, and they are using their own private parking lot in'",
        "'speaker_6': 'order to do things like a tent outside in the park, which is not normally allowed in your parking lot. We also want to continue that until September 30th and then we'd you know, that does need to eventually go back to normal.'",
        "'speaker_6': 'But we understand that would not just be restaurants that would still be open to everybody.'",
        "'speaker_0': 'Okay. And just to clarify, I'll make this clarifications also with customers. And that's it's it's my understanding that the extension is for restaurants and bars due to September 30th. And then if there are there are ten of these parklets that are kind of non restaurants, but also non extensions into the parking lots.'",
        "'speaker_0': 'Is there a way that we could get to these that we can work with these ten? I want to make sure that are one of the chance to support the broader program but get to what people are looking for.'",
        "'speaker_0': 'Is there a way maybe Mr. Murray got you to address those ten that are maybe out there that are in this unique spot?'",
        "'speaker_6': 'So all ten would have the ability to use if they have private area, they could all apply now for an occasional use permit and and be able to use their parking lot. Some might not have that, some might only have a parklet.'",
        "'speaker_6': 'I just don't have that information in front of us on those ten specific cases.'",
        "'speaker_0': 'Okay. Well, let's, let's keep the conversation going. I think councilman's in the house or right. As of right now, at this moment, the sub sub is to extend all restaurants and bars until September 30th or October one. And we're still having a conversation about these possible ten businesses.'",
        "'speaker_0': 'And this includes Tom. So all the businesses that have their their their extensions like like nail salons, I know there are some barbers that have there are going into their parking lots. Those all can still continue beyond the June 30th thing.'",
        "'speaker_0': 'Correct.'",
        "'speaker_6': 'That's that's recommendation. Anybody that has the OP would be able to continue to use their parking lot until September 30th, but we don't really have a permanent process for them. Going beyond that really is against the zoning code.'",
        "'speaker_6': 'So that would need to end in September 30th unless we come up with a brand new program.'",
        "'speaker_0': 'Okay. And maybe that's something we can look at between now and September 30th and ways of helping those businesses out there. You know, if there's a possibility to provide some resources there, let me just keep going. So we know where the sub sub is right now and we'll just keep going.'",
        "'speaker_0': 'Vice Mayor Richardson.'",
        "'speaker_3': 'Thanks, Mr. Mayor. Just a couple of things, though. Thanks for clarifying with the EPA. We have way more EPA in the parking lots in North Lobby, so I'm glad to hear that that will continue. But I agree with what you just said.'",
        "'speaker_3': 'We certainly need to figure out what a solution is between now and then, particularly, you know, is there alignment with the recovery funds to see if we can help them make some of these outdoor patios more permanent? Because I'll tell you, there will still be interest there in terms of I want to be sympathetic to Councilmember Al'",
        "'speaker_3': 'Allen hadn't thought about the non restaurant operators and I know that there are a few gyms that have gone outside. Those are significant investments. If those were included, if those are included. What is the difference between the main motion and the substitute substitute motion?'",
        "'speaker_3': 'If the only difference was narrowing it back to businesses. But Mr. Katainen Do you see a difference.'",
        "'speaker_6': 'In the motion? Vice Mayor. Thank you. Yes. The difference I saw was that the substitute substitute eliminates any parklet, not the overpass, but any parklet that is not a restaurant. And I believe the mayor has added bars. If that was part of the substitute substitute.'",
        "'speaker_6': 'So bars and or restaurant as Parklets and these other ten that have been mentioned as the number of Parklets would not be able to continue under the substitute substitute under the main motion. All Parklets would continue until that date.'",
        "'speaker_3': 'So if this narrows, think about ten, ten businesses. I think before we make that decision, we need to understand where they are, who they are, and how they how they feel about this. I don't know that that and I would love to hear it.'",
        "'speaker_3': 'Whether those ten or not are the are, you know, help advance some of the interests that Councilmember Price mentioned in terms of her subs to motion. We're talking about ten businesses and it's going to make a difference to them.'",
        "'speaker_3': 'I prefer to make a vote on the main motion. I don't see I'm not hearing an art a compelling argument on by exclude these ten businesses. What I'd love to do is get back, withdraw the substitute motions and get back to the main motion that I think effectively does what I've heard people talk about.'",
        "'speaker_3': 'And if there are very specific concerns, then we just adjust the main motion to address those very specific concerns. I'm not seeing a big difference between the May motion and the substance substitute, except for the fact that excludes ten businesses that we don't have a lot of information on those businesses.'",
        "'speaker_3': 'I'm not comfortable I'm not comfortable supporting at all. And those are my comments. I would leave the makers of the book up to figure out what to do, but it seems to me the cleanest thing to do is just get back to the last.'",
        "'speaker_0': 'Let me just keep going to the queue, Councilman. Mongo.'",
        "'speaker_2': 'Thank you. I know a little bit more about some of them. And what I've heard from staff is that it would be helpful if potentially we include those gems. Gyms have been closed the longest. They actually were full closures.'",
        "'speaker_2': 'And so if miss that day is open to a friendly amendment to allow. Gyms and personal services to continue into your friendly. That would be helpful.'",
        "'speaker_6': 'Councilmember Omar Gonzalez, city attorney. I think the the cleanest way to do it would be to withdraw the substitute substitute and return to the main motion, which would address, I think, the issues identified by Councilmember Allen and the vice mayor and possibly the councilmember for the first District.'",
        "'speaker_6': 'That would assume, obviously, that you would either vote on or withdraw the substitute motion also, but the main motion would address those issues.'",
        "'speaker_2': 'Mr. City Attorney, thank you for your input. Unfortunately, it does not address the parklets that are held by office uses and office uses are currently taking up some parklet parking spaces. And so I think that including the barbers and personal care services and other businesses that really can't function on Zoom or WebEx or any of those those'",
        "'speaker_2': 'office uses is where we were kind of making sure to hit that. And again, this is just sort of context that I'm assuming based on the 30, 90 minute roundtables I sat in with Mr. Keisler over a period of three weeks.'",
        "'speaker_2': 'I think what Mr. de Haas is looking to accomplish and what Ms.. Allen is looking to accomplish would be possible if what I saw was the sun has not been, but I'd like to hear a verbal option on accepting a friendly to expand her motion to include.'",
        "'speaker_2': 'Parklets that are not currently used for office uses, so that would be permanent adding personal care services and gyms. And I think that meets the needs of Miss Allen while still addressing the needs of the community and reducing the number of outdoor spaces for office uses.'",
        "'speaker_2': 'Where those parking spaces are still critical and or could potentially create an unsafe use in that area where other parklets could be expanded to those safe uses in areas that are maybe not as much need, but thank you for the recommendation.'",
        "'speaker_2': 'Ms.. And they are councilman's in the house. Are you open to my friendly? Yes. I also want to make clear that with my motion. And thank you, Councilmember Allen, for reminding me of all the businesses that are out there.'",
        "'speaker_2': 'I do not in no way want to eliminate any of our businesses the opportunity to be able to succeed, especially if a parklet is going to be what's going to help them succeed and move forward. So with my motion, I was trying to get the the first motion from Councilwoman Allen, and I'm trying to find a middle'",
        "'speaker_2': 'space, a middle place for Councilmember Price as well. I know that she had some concerns. And how do you feel about about that? Would that do you think, Councilmember Allen, do you think that would satisfy the businesses you're concerned about to.'",
        "'speaker_2': 'The gyms and the personal care services. And yes, as long as as long as you have anyone that currently has a parklet, as long as I definitely don't want to interfere with anyone's livelihood. And and it's they still need some more time.'",
        "'speaker_2': 'This is still really fresh for businesses. So as long as there's any business that's currently operating a parklet has the ability to still do so and seek a permanent a permanent PARKLET. So it may be I guess I would be looking for staff to tell me, are there any other parklets that are outside of personal services and'",
        "'speaker_2': 'jams? And if there are, I would want them included as well.'",
        "'speaker_6': 'So we believe that there is one parklet that would not meet that definition or roughly around that, and it is one that is a retail or it is a real estate firm, but all the rest, we believe, would be covered.'",
        "'speaker_0': 'Okay. So just to be clear, the motion that's on the table right now covers all parklets across the city, with the exception of possibly one parklet. That is that is a retailer. Is that correct? Mr. Marika.'",
        "'speaker_6': 'We believe that's the case. Yes.'",
        "'speaker_0': 'And as a reminder also that I know we're talking about the extension provides an extension. Any parklet currently operating can still apply for permanency tomorrow. You know, so that's still a process that that's that's that's moving forward. Let me keep going down the list.'",
        "'speaker_0': 'Councilman Price.'",
        "'speaker_2': 'Thank you. And I just wanted to clarify, I don't have an issue with gyms and personal care who have to come outside in order to be able to open their business at some level. My issue is really with the realtor that is taking what's a major traffic safety concern where it's located, but also it's taking 2 to'",
        "'speaker_2': '3 parking spots from a really dense neighborhood where coastal access is as important priority. So I would just ask that they not I don't even know that they're wanting to extend their parklet because all their business is indoors now.'",
        "'speaker_2': 'But I just don't think an automatic extension is necessary for them now. If we go back to them and they say, You know what, we'd really like to have it. Then then maybe we can consider that for them.'",
        "'speaker_2': 'But I just I don't believe an automatic extension is justified for a business that has indoor space and often sees clients outside of the office anyway.'",
        "'speaker_0': 'Okay. I have Councilmember Gringo.'",
        "'speaker_4': 'Thank you. All right. They have forgotten about me. That appreciated a lot of a lot of the questions that I have had sort of been dealt with. But just to make a quick comment, and I do have a question.'",
        "'speaker_4': 'I think we're trying to get into the minutia of these items. Now, that were originally the original motion, I think was pretty straightforward that we can address, that staff can address and come back by September 30th. And then after that, the decisions can be made as far as what parties can and cannot stay.'",
        "'speaker_4': 'The one question I have is what about preexisting parklets? And we had a few. Are they going to be grandfathered in or are they going to be thrown into the into the basket in regards to be reevaluated for permanency or not?'",
        "'speaker_6': 'Yes, sir, that's a good question. So anything that is permanent had already gone through a process. They've all been permitted. Those would stay. There wouldn't be any change to those. We're really just talking about the ones that are under the emergency authorization.'",
        "'speaker_4': 'Okay. I appreciate that very much. That's all I have. And. Oh, and by the way, the the. I guess we would call it a parklets. But those that are in parking lots that those are continuing to go under and OVP processed, is that is that correct?'",
        "'speaker_4': 'So it's not part of this discussion that we have here.'",
        "'speaker_6': 'They would also get an extension of their EAP through September 30th for all users, not restricted anything.'",
        "'speaker_4': 'Okay. But then after September 30th, we're back to the OVP process.'",
        "'speaker_6': 'So after September 30th, we would envision that those uses would start to become less frequent. We can certainly I'm hearing some interest from the council on how can we continue some of those if they're appropriate. We would be in during the study period, come back with some ideas.'",
        "'speaker_6': 'But again, we're really using allowing them to use something that is traditionally only designed for parking for very different and non-conventional uses.'",
        "'speaker_4': 'Okay. Thank you very much.'",
        "'speaker_0': 'Okay. Thank you. I have everyone who has spoken. So let me just clarify for the city of Tripoli and for the city manager, there is a motion on the floor that would provide an extension to October 1st for all parklets.'",
        "'speaker_0': 'I think with the exception of one use, which is a real estate use, I think that was the motion. And and of course this includes the all the parklets under a program developed by staff to support all the other extensions and to that are happening at parking lots that are happening in other places to work with the'",
        "'speaker_0': 'community and provide and create a program for permanency. Did I get that correct? Mr. Modica or Mr. City attorney.'",
        "'speaker_6': 'Yes, that's the way we understand the motion is that the extension for the PARKLETS would include all businesses with the exception of.'",
        "'speaker_3': 'The realtor or commercial use.'",
        "'speaker_6': 'Yes. And then we would be looking as we go towards the permanent process for things like safety and working with residence and parking and all of those considerations that were listed. I do want to add one thing, Mayor, that we haven't discussed, that I just want to make sure the council's aware of.'",
        "'speaker_6': 'We when we first put these parklets out, we just did them. We didn't, you know, go and get any paperwork. We just did them. We then went back in around January and created formal documentation where we made the business owners sign off and say they understand that they have a parklet.'",
        "'speaker_6': 'They had certain esthetic requirements, they had certain ADA issues that they had to acknowledge as well as as well as safety issues and insurance. To date, most have signed that document, but we have about 30 who have never acknowledged it.'",
        "'speaker_6': 'And we've been very, very patient. We gave them until January and then until March and now until May. I really need to get those signed. So I would like just to let you know that I'm planning that any if any business hasn't signed off on just those basic acknowledgments that they would not be eligible for the extension'",
        "'speaker_6': 'on June 30th.'",
        "'speaker_0': 'Yeah. I mean, citing the basic things that the basic paperwork seems seems pretty basic, so. Councilman Mongo.'",
        "'speaker_2': 'Thank you. I just want to be clear that that is not the motion on the floor. The motion on the floor is to include all non office related uses because while Miss Price may have a realtor use, I had an office use on a street in my business corridor that did not need an outdoor use.'",
        "'speaker_2': 'And so I think that it's really important that the motion, as I presented it, the friendly that was accepted by Ms. Van de Vos, is what we actually are voting on. And while the. Parklet may or may not be there today.'",
        "'speaker_2': 'I know it was there a few weeks ago and it was an office use outdoor, taking up multiple parking spaces from a corridor which was one of our two busiest corridors in the district that is constantly in need of parking.'",
        "'speaker_2': 'And so this particular business use this office space to use. Can operate from Zoom or any of those other alternatives and is not necessary to work outdoors. So just to be clear, if there's a change to the motion on the floor, I'd really like to know before I vote on it.'",
        "'speaker_2': 'But what I had made a friendly was to add in all those other uses except for. Office related type users. So adding personal care services, gyms and restaurants and bars were all in there. And maybe the one operating in my district is operating rogue and is not authorized.'",
        "'speaker_2': 'I'm happy to work with city staff on that.'",
        "'speaker_6': 'So this is Thomas Jefferson standing is it's not office use. So we understand that if it's realtor we need to treat all of those cases the same. So yes, it would I think go the way to say non office is a good description.'",
        "'speaker_2': 'And I also don't want to target one industry of realtor versus another industry. It's all non office. If you don't have to be in person to serve someone food or provide them the equipment to work out with or to actually cut their hair or do their nails.'",
        "'speaker_2': 'Then there are options for you should you continue to not want to operate indoors. Thank you.'",
        "'speaker_0': 'Thank you. And I think, Mr. Monaco, what you're saying is that that's a good clarification, I think. And I think it's an important one. I think and I think what you're saying also, Mr. Modica, is that's a very limited it might be maybe just a small one or two that that would fall in that category.'",
        "'speaker_0': 'Right. Vice Mayor Richardson.'",
        "'speaker_3': 'Thanks, Mr. Mayor. I was just going to raise that. So to do a policy that excludes a particular business I'm uncomfortable with. I think, however, how Councilmember Mongo frames it is a little bit broader by just saying that maybe a category of non of office related businesses or wherever that category is may seem a little safe.'",
        "'speaker_3': 'But I just wanted to raise this with the city attorney. Just, you know, are we setting a policy by, you know, one particular business? But would you recommend that we go about we started the motion this way by looking at a category that's exempt.'",
        "'speaker_3': 'I just I needed to raise the question.'",
        "'speaker_4': 'Vice mayor.'",
        "'speaker_6': 'Vice mayor. Yes. And the Councilmember Mungo's point, I thought I did say office use. I did say that what I had heard is that one example was the realtor. But it is it would be by use. So if there's more other businesses within that category, I think council's making a policy decision that they do not get the'",
        "'speaker_6': 'extension for a parklet.'",
        "'speaker_3': 'Okay. So much more much I'm comfortable with at least having that conversation. Look at council members. You've got to defer to them to know what's best in their districts. And it seems like we're in a place where everybody's gotten the things that they need.'",
        "'speaker_3': 'Very close to the emotion, but nuanced. So I'm happy to support the motion from.'",
        "'speaker_0': 'Okay. Then just to clarify one more time. It's extension to the first minus office. Use attorney to make sure we're on the same page. Is that correct?'",
        "'speaker_6': 'That is correct.'",
        "'speaker_0': 'Okay. That's what it is. And they have to confirm. That's correct.'",
        "'speaker_2': 'Yes.'",
        "'speaker_0': 'Okay. Councilmember Austin.'",
        "'speaker_4': 'I just need to clarify one thing, and that is in the motion, we will not be having any new parklets unless they are applied. They go through an application process. This is just to extend existing parklets, is that correct?'",
        "'speaker_6': 'That's correct. The funding for the program to put out brand new temporary parklets has also expired.'",
        "'speaker_4': 'Okay. Thank you.'",
        "'speaker_0': 'And Councilman Allen.'",
        "'speaker_2': 'Yeah. And that was my question that Councilman Alston. So if there anyone even prior to COVID that was an office space could have applied for a parklet and could be issued it and they still have that opportunity. So even though they're excluded from this extension, they have every right to go ahead and apply and possibly get or'",
        "'speaker_2': 'get denied. That's still available to them, correct?'",
        "'speaker_6': 'Not necessarily. So the PARKLET program started as being solely restaurants, and then the council helped adopt that program and we actually expanded into fitness and some of the personal care outdoor services. We did not go to retail as we didn't want to have that become like, you know, clothing racks out on the street, for example, or office'",
        "'speaker_6': 'type uses. So in our current program for permanent parklets, those are not authorized uses. It's gyms and restaurants, I believe.'",
        "'speaker_0': 'Okay. And I would imagine, however, can I interpret a little bit different? That's okay. So if there if there is a if there is a a business or a use that would like to become a parklet or that is within this, you know, June 30th date, they can always work with the city and try to contact the'",
        "'speaker_0': 'city and look for alternatives or see if they can get some kind of change. Because we've done that in the past. For example, when gyms weren't allowed parklets for gyms weren't allowed. We made the change actually in the code.'",
        "'speaker_0': 'I just want to make sure be very clear that the extension is, well, we're extending almost everyone. Even if you fall into that category, you can still work with the city on options and different opportunities for your business.'",
        "'speaker_0': 'And so I just want to make sure that that's also. But then also just your purpose closes tomorrow as well.'",
        "'speaker_6': 'I'd like to have some direction on that because that is a little bit different. I'm hearing now that anybody who currently has a parklet those types of uses, then you would want us to expand the park, extend the parklet, but we just took policy action to get rid of a specific office use.'",
        "'speaker_6': 'So if that's going to change for the permanent program, I kind of need to hear that from the council.'",
        "'speaker_0': 'I don't think you've heard that from the council yet. Councilman Price.'",
        "'speaker_2': 'I didn't hear the mayor say that. I think he's talking about if if there's a non. One of the uses that doesn't fit into this current automatic extension. They can always go through the process of applying for a permanent parklet and I support that as well.'",
        "'speaker_2': 'I will say, I mean, I really did want to highlight this, but at Tom's comments, Mr. Motive, his comments about the types of parklets we have allowed kind of begs the question why? What is council and press talking about then?'",
        "'speaker_2': 'And the reality is that our bids, we're working very closely with public works on the parklets that were being put onto Second Street. And then one day a parklet appeared that the bid didn't know anything about and the council office did know anything about.'",
        "'speaker_2': 'And of course we don't want to shut down their parklet, but it is a real tea place and it's on it's on a very it's a major corner, a very prominent major corner inn in Belmont. SHAW And so it's taken 92 to 3 parking spots and up in a highly dense parking impacted area where coastal access is'",
        "'speaker_2': 'our number one priority. And it's just not a need that's necessary anymore. And that's why I was hoping for some customization, because we think we might be able to work with that business owner to allow for some outdoor seating, but we don't need 2 to 3 parking spots for it.'",
        "'speaker_2': 'And I don't know that they were ever supposed to get one to begin with, but so the residents have been really counting down the days until the the June 30th deadline, as we have told them, that that that was a mistake that we made and we apologize for that and that we will be more mindful of what'",
        "'speaker_2': 'parklets continue. So I appreciate everyone's conversation. And and I'm sure to some people, it seems like while they're sitting here talking about one business before we started to have this discussion, we had no idea. I had no idea how many of these businesses we had.'",
        "'speaker_2': 'So sometimes these discussions among all of us as council colleagues is an opportunity for us to learn what is happening in other districts, and we whittle it down to what the main issues are. And sometimes that takes time.'",
        "'speaker_2': 'But certainly if all of us have come into this knowing there's only one business to talk about, the conversation would have been streamlined. But we have Brown app, so we do a lot of these things in the public setting and sometimes that takes time.'",
        "'speaker_2': 'So thank you, everyone.'",
        "'speaker_6': 'And Councilmember Price is being very accurate and also very nice. That was not intended to be a parklet in in our rush to just get these out and to help one was put out that was not meeting the guidelines and I think she's correctly at and identified that and that would be a good one to rectify.'",
        "'speaker_0': 'Well, thank you. And I once I've been cued up and spoken, I want to just kind of close I think Councilman Price said it right. I just want to just remind us that what we're really doing tonight is extending almost every single parklet in the city to October 1st.'",
        "'speaker_0': 'And that's what are and even though we've been discussing certain different types of businesses, I just want to thank everyone at the end of the day. Well, this is what this is about. And what the conversation is about is supporting the the dozens and dozens of restaurants and bars of businesses that are using parking lots or using'",
        "'speaker_0': 'Parklets to get through this pandemic. And so I just want to thank all of you for for that work and staff. I know that this is also a lot of work for all of you. But this this additional time will allow you guys to figure out that permanent program and just continue to support these these small businesses'",
        "'speaker_0': 'that really need it. So just thank the entire council. I'm glad that we did have were able to have that discussion. Let me go and turn this over to the clerk. We'll do the roll call and we did public comment roll.'",
        "'speaker_1': 'Complements and they have.'",
        "'speaker_5': 'I'm.'",
        "'speaker_1': 'Councilwoman Allen.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Councilwoman Pryce. I can opener.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Catwoman manga. I can't swim in sorrow. I can't remember. Councilmember Oranga. I mean, Austin.'",
        "'speaker_4': 'All right.'",
        "'speaker_1': 'Vice Mayor Richardson. I'm pushing. Kay.'",
        "'speaker_0': 'Thank you. I think we have we are open for the comment. We might have one. Can we do that, please? You can start now.'"
    ],
    "Resolution to Certify the Final Program EIR/EIS-03-17 and Related Actions.": [
        "'speaker_1': 'Item 21 Report from Development Services. Recommendation two Adobe Resolution Certifying the final program EIA on adopting a Global Master Specific Plan Accepting the decision action of the L.A. County Airport Land Use Commission relating to the Globemaster Quarter specific plan.'",
        "'speaker_1': 'Declare ordnance amending the Ombudsman's proposed sections relating to implementations of the Globemaster specific plan and ordinance. Amending the Use District Map to reflect the establishment of the Globemaster Cortez Pacific Plan. Read the first time and lead over to the next regular meeting of the City Council for Final Reading District five and seven.'",
        "'speaker_0': 'Thank you very much. This is a hearings that will follow this, a hearing order. There is no oath required, correct, Madam Clerk?'",
        "'speaker_1': 'Correct.'",
        "'speaker_0': 'Okay, great. So let's go. So let's go ahead and turn it over to staff to begin the hearing.'",
        "'speaker_8': 'I'd like to introduce Patricia Defender for the the planning.'",
        "'speaker_2': 'Manager to make a presentation on this item.'",
        "'speaker_1': 'Evening. Mayor. Vice mayor, city council members. My name is Patricia Devendorf. The item before you is a specific plan for the former Boeing C-17 manufacturing site and surrounding areas. This plan is centered on the reuse and redevelopment of the Boeing C-17 facilities located on the west side of the airport and the transformation of that site into a'",
        "'speaker_1': '21st century employment district. The plan also includes surrounding commercial and industrial areas. The actions that are before the City Council this evening represent the final steps to approve the specific plan, which has been in development since 2018. In December 2020, a planning commission held a public hearing on the specific plan and voted to forward the specific plan'",
        "'speaker_1': 'to the City Council with a recommendation of approval. Following planning permission, the project was heard at the Los Angeles County Airport Land Use Commission, a look which found the project consistent with the county's airport land use plan. The city was awarded a federal grant in 2015 to complete the three Phase C17 Transition Master Plan.'",
        "'speaker_1': 'Phase one, which was to study existing conditions and alternative land use scenarios for future use of the site was completed in 2016 and phase two kicked off after that time. Phase two has involved preparation of the land use plan, which is the specific plan that's before the council.'",
        "'speaker_1': 'When this phase is complete, the city will transition to phase three, which is to assist dislocated workers and affected firms and to facilitate business development and job creation. Those tasks will be implemented by the Economic Development Department. Estate planning and zoning law has authorizes cities to prepare a specific plan to implement their general plans, specific plans or'",
        "'speaker_1': 'customized zoning regulations for a defined geographic area. They enable the city to establish a guiding vision and land use regulations that help implement that vision. And they identify and plan for infrastructure improvements needed to support the contemplated development and mechanisms to fund those improvements.'",
        "'speaker_1': 'It also further allows a streamlined review process for developments that are consistent with the specific plan. Major economic investment is currently taking place in the city, in the vicinity of the airport and Douglas Park area, which is seeing a clustering of aerospace industries, particularly rocket manufacturing and small satellite launch companies.'",
        "'speaker_1': 'The adoption of this specific plan will help ensure continued business attraction and job growth in the area and support the successful re-use of the Boeing property. There are 24 aerospace, manufacturing, engineering and design companies based in Langley, Long Beach, and as of January 2020, the industry provided 6500 direct jobs.'",
        "'speaker_1': 'Recent companies to make Long Beach their home in these industries are. Virgin orbit rockets. Rocket Lab. Relativity. Space spin launch. Morph three of 3D and Space X. The specific plan can help support the continued clustering of these related industries in the area and take advantage of the area's proximity to freeways, the airport and the port.'",
        "'speaker_1': 'The specific plan consists of 437 acres and is centered around the former C-17 manufacturing site. And Terry Avenue is the North-South access in Spring Street is the East West access. The specific plan area is encompassed within the Long Beach boundaries, but abuts the cities of Signal Hill and Lakewood.'",
        "'speaker_1': 'Vision of the plan is to transform the area to a 21st century employment district that attracts leading edge firms and takes advantage of its local, regional and global transportation connections. This vision is supported and implemented by a number of goals that include stimulating economic development and job growth, cultivating human capital, encouraging land use and transportation improvements on'",
        "'speaker_1': 'Cherry Avenue that support surrounding businesses. And increasing mobility choices and reducing vehicular traffic. The plan has six land use districts which are tailored zoning districts for the sub areas of the plan and two overlay zones. The Business Park District, which is shown in the light blue, makes up the core of the plan and covers the former Boeing'",
        "'speaker_1': 'site, allowing a variety of industrial and commercial redevelopment of the site. This could include office, campus, commercial, industrial, business, park manufacturing, warehousing and research and development uses. The airport district is specifically for airport property, and aviation related use of the remaining districts are largely commercial industrial that allow uses similar to those allowed in Title 21 zoning but'",
        "'speaker_1': 'that are tailored for the area. The area is divided into four geographic areas based on existing and planned land uses and the role it plays in the broader vision for the area. The North Area is comprised of lots adjacent to Cherry Avenue, as planned for commercial uses and light industrial.'",
        "'speaker_1': 'The central includes the Boeing site and the uses that I describe before the business park and supportive uses industrial and other supportive uses. The southern area centered on Spring Street is zoned largely for industrial and commercial uses, with the aim of continuing a commercial continuous commercial corridor on Cherry Avenue to create a spine, a commercial spine for'",
        "'speaker_1': 'the area in the southeastern areas reserved for general industrial and airport related uses. As noted previously, the city is in the second phase of the C17 transition plan process. Outreach has been ongoing since the first phase. During the second phase, staff, which was for the development of this plan, staff held three workshops to hear the community and'",
        "'speaker_1': 'stakeholders needs and concerns for the project area and how they wanted to see the plan take shape. But South heard at these workshops played a large role in informing the development of the plan. The slide here shows the major points that were expressed by the community that have been incorporated into the vision and regulations of the plan'",
        "'speaker_1': 'to the extent feasible. They include providing pedestrian oriented retail amenities. Improving safety and appearance of streets. Allowing flexibility in permitted uses and standards. Protecting existing businesses and ensuring sufficient parking, among other comments. This project staff prepared a program IIR as well as an impact environmental impact statement or EIAS, which is required under federal law.'",
        "'speaker_1': 'Since this project received federal funding, this was necessary because of the federal funding that the city received. We are currently at the second to last point in this process shown on this chart, which is the City Council hearing.'",
        "'speaker_1': 'This slide lists the issues that were fully analyzed in the Environmental Impact Report, Environmental Impact Statement. And that means that these issues were identified as potentially having impacts, but were mitigated to less than significant levels. And those include esthetics, air quality, cultural resources.'",
        "'speaker_1': 'These were the items that were analyzed fully greenhouse gas emissions hazards and hazards. Materials, noise, transportation, utilities and service systems. These were the issues that were found to be less than significant, that they were able to be mitigated through the mitigations of the air.'",
        "'speaker_1': 'And those include esthetics, air quality, cultural resources, hazards and hazardous materials, noise, etc., as showed on the slide here. This slide shows the issues that were found to be significant and unavoidable, even with mitigation incorporated and those included.'",
        "'speaker_1': 'Air quality cultural resources, greenhouse gas emissions and transportation. The environmental review process requires both Sequoia and NEPA require consideration of project alternatives to identify an environmentally superior alternative to alternatives were considered the first one. The no project alternative was found to not meet the project objectives.'",
        "'speaker_1': 'The second alternative, the reduced project alternative, was found to be environmentally superior, but would only partially meet the project objectives and would fail to meet them as fully as the proposed project while still having significant and unavoidable impacts, although albeit reduced.'",
        "'speaker_1': 'And that's the reason that the the plan as proposed is, is what's recommended today. Eight Agency comments were received in on the drafty air in responses to each of these comments were provided in the final air. The city also received additional comments, including comment from the Cow Heights Neighborhood Association after the close of comment period.'",
        "'speaker_1': 'But all the comments were responded to directly by the city to those who submitted comments. Due to the significant and unavoidable impacts, the city must adopt a statement of overriding considerations when certifying this year. This slide lists the considerations in support of the statement of overriding considerations.'",
        "'speaker_1': 'The benefits of the project were found to outweigh the project impacts of because the plan meets the objectives of the project, aligns with the city's general plan and economic development goals, generates jobs and strengthens the city's tax base, and lays out a plan for improving infrastructure in the area in conjunction with new development.'",
        "'speaker_1': 'As previously noted, the Planning Commission held a public hearing on this item on December 17, 2020. A variety of comments and opinions were expressed, many of them in support of the plan. The areas of concern are listed on this slide include concerns about ensuring open space connections.'",
        "'speaker_1': 'Design of the streets, level of service and transportation impacts. Office parking reductions and parking requirements in general were among the comments that were provided. The city's response to the comments. One of the comments was also from the city of Signal Hill, specifically about concerns about transportation impacts.'",
        "'speaker_1': 'And I'm going to discuss that in a little more detail. Five letters have also been received leading up to tonight's hearing that have been forwarded to the council, including follow up letters from the Council Heights Neighborhood Association and the City of Signal Hill.'",
        "'speaker_1': 'The Planning Commission did recommend the City Council certify the EIA. EIA adopt the resolution establishing the specific plan, adopt a zoning code amendment for PD 13 and PD and the repeal of PD sorry, PD 19 and the repeal of PD 13 and adopt a zone change to implement the new specific plan.'",
        "'speaker_1': 'The LA, the Los Angeles County Airport Land Use Commission held a public hearing on the specific plan on March 3rd, 2021. The purpose of this hearing was to determine the specific plans consistency with the airport land use plan.'",
        "'speaker_1': 'This is an important step in demonstrating that the plan is not in conflict with the airport and that future land uses will not be negatively affected by the airport or by the airport operations. The ALA made positive findings to declare the plan to be consistent with the county's land use plan.'",
        "'speaker_1': 'This was procedurally required to take place between Planning Commission and the City Council. In particular, staff wanted to take a moment to address comments submitted by the City of Signal Hill. The City of Signal Hill expressed concerns about traffic impacts, impacts that proposed that the proposed plan may have on streets in the adjacent, in the air, in'",
        "'speaker_1': 'the city and adjacent to the city. Staff had followed up with City of Signal Hill after the December Planning Commission hearing. There were concerns specifically about mitigation measures being deemed infeasible. Those are mitigation measures that would involve roadway improvements.'",
        "'speaker_1': 'The air did determine those. Some of those improvements would be infeasible because the intersections are not wholly in the city and therefore the implementation of the improvement is uncertain and requires ongoing coordination with other jurisdictions to be implemented.'",
        "'speaker_1': 'Some of those improvements also were deemed to be infeasible because they conflict with the multi-modal goals of the specific plan and the city's adopted mobility plan. However, as is also stated in the ER analysis and the response to comments, the city has committed to signal that the city will coordinate and work with them on a project level'",
        "'speaker_1': 'based on a specific basis through the development review process for future developments to identify additional transportation improvements that will minimize traffic impacts. The city also has agreed to pay the fair share for established transportation mitigations that have been identified that would be identified in the city of Signal Hill as as appropriate in the future.'",
        "'speaker_1': 'So without ads tonight, Seth asks the city council to take the final steps to approve the specific plan. These actions involve certifying the IRS, adopting the resolution, establishing the specific plan, adopting a resolution, accepting the action of the Airport Land Use Commission, adopting a zoning code amendment, and adopting its own change to implement the specific plan.'",
        "'speaker_1': 'That concludes my presentation. Staff is available to answer questions and members of the consultant team that help the city prepare the specific plan are also on the line. Thank you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_5': 'And, Mr. Mayor, this is Mike May's end before we move on. As the last slide indicated, there is three resolutions and two ordinances. And because of the nature of this action and the environmental impact, the environmental impact statement that will have to be adopted will need a separate roll call vote on the three resolutions and the two'",
        "'speaker_5': 'ordinances if we get to that point.'",
        "'speaker_0': 'Okay. Thank you. And we'll do public comment now.'",
        "'speaker_3': 'Anthony Souza. He's been. Mr. Mayor. City Council members. Staff. Good afternoon. My name is Anthony Souza. I've been a person of Long Beach my whole life. I went to St Anthony's High School and my kids and grandkids currently live here.'",
        "'speaker_3': 'I've owned a number of businesses in the city and I've always supported the city in any way I could. Over the past 25 years, I've been purchasing and approving parts of south of Bordeaux, the cherry, which has been zoned Eigg a small part zone PD 19.'",
        "'speaker_3': 'This area would now be part of a Grand Master Corridor plan. I feel this is it. This is an ambitious plan and a good plan overall. It is not completely considered the many small parcels south of Bordeaux, such as myself and many others.'",
        "'speaker_3': 'There are many uses in this area and some have been operating over 60 years. And we'll probably operate there a few more decades. There was a car wash on the corner that has a writing commitment to be there another 30 years.'",
        "'speaker_3': 'The other side of my property there is a dry cleaner that is generational now. It's not going away soon. Then you have H and y rebar and buy and hold digging and have kids and grandchildren running them now.'",
        "'speaker_3': 'And it's them. I understand that the city would like to have the DC SP adopted. So I feel it's only fair that the plan not be detrimental to the long term businesses and property owners by itself. I believe this could be accomplished by eliminating the PD 19 zoning as as you want and grant grandfathering in the example'",
        "'speaker_3': 'with an overlay of that CSP for the next 15 years, or at least until the C 17 site is fully developed. Once the C 17 site is about it's redeveloped and you have a robust employment center and an economic driver, the small site may become feasible to develop.'",
        "'speaker_3': 'I want to thank you for your consideration. Ward Mays, please begin. Good evening, Mayor Garcia and fellow council members. My name is Ward Mace and with Good Men, a global property company that owns, manages and develops properties in gateway cities.'",
        "'speaker_3': 'For those of you that don't know, we are the company that acquired the former Boeing C-17 manufacturing plant approximately two years ago. And I've had the pleasure of working with staff through the specific plan in the air and are excited and grateful to see this project before the City Council tonight and would like to thank those of'",
        "'speaker_3': 'us or those that that helped us get there. Oscar Orsi, Christopher Koontz, Scott Kennedy and a whole host of others that we're working on this since 2015, long before we acquired the property. But what I wanted to share with you all is that we continue to receive significant inquiries about the property and are grateful to the city'",
        "'speaker_3': 'for having been able to license the property to a number of production companies, including Apple TV and Netflix is completing a feature film, The Gray Man that will be released next year. However, most important has been the learning that as we've gotten to know the property, the learning of the unique attributes of these buildings, the clear height'",
        "'speaker_3': ', the bay spacing, the power, the significant power with the astro substation and the excess land that makes them incredibly value valuable in the market. And specifically, I want to leave you with letting you know that I look forward to sharing with you some very exciting news in the next upcoming weeks.'",
        "'speaker_3': 'Thank you. That concludes public comment.'",
        "'speaker_0': 'Thank you. Will close public comment. Now go to Councilman Monk.'",
        "'speaker_2': 'Thank you, Mr. Mayor. The staff presentation was excellent. Many have already seen it at the Planning Commission. I do want to highlight comments from both of our public speakers. Mr. Mace, I appreciate that you like the unique attributes of those buildings.'",
        "'speaker_2': 'It was my first trip with the mayor to Washington, DC, where his chief of staff and I were up at dawn in office after office arguing to not allow those buildings to be destroyed. They would have had a significant environmental impact to the communities around them.'",
        "'speaker_2': 'Mr. Odinga was very supportive of this position and keeping these buildings and reducing the impacts to those adjacent neighborhoods. And I think that many don't know how much work goes in beforehand. When we get to a project of this magnitude.'",
        "'speaker_2': 'We talk about the 24 aerospace companies that are in Long Beach and the development services team talks about the 6500 jobs. But I go to those locations and those are not just jobs. Those are careers that will set young, innovative individuals on trajectories for a lifetime.'",
        "'speaker_2': 'But innovating on behalf of our community, our region, and, quite frankly, our country as we take on the international competition of space and satellites. Slide seven. Outlines 437 acre property. And many have commented on the noncontiguous look of that map.'",
        "'speaker_2': 'If you could put up Slide seven, that would be appreciated and some of the questions related to the overlays. I think that it's important to note that not all of the area is in the city of Long Beach.'",
        "'speaker_2': 'And so when you see that map, there's a carve out on Slide seven, which is the city of Lakewood. And so that is why there is a bit of noncontiguous ness in the plan. As you move along to Slide nine and you look at the cherry overlay, there's often a question as to why the requirement for Community'",
        "'speaker_2': 'and Cherry Avenue overlay zone does not apply to both sides of the street. And perhaps it should. But today, we are eager and excited to approve a plan with minor modifications, because we do have many corporations looking to provide additional career opportunities to the residents of Long Beach.'",
        "'speaker_2': 'And we do feel that the work that has been done over the last you can argue for years, I would argue six years to get to this point has been significant. Specifically when we look at the existing businesses and the need to ensure that they're protected, as was outlined on Slide 12 by the community.'",
        "'speaker_2': 'As one of their concerns. So that's three slides ahead. We want back one. Thank you. They want to ensure protecting existing businesses and something has changed since some of the initial community input meetings. What has changed is COVID.'",
        "'speaker_2': 'And so initially we were moving forward with this plan with great steam and determination. But today I ask that we make some minor modifications. City Clerk I don't know how many minutes I have left, but I'd like to read into the record the suggested amendments to the Globemaster corridor specific plan.'",
        "'speaker_2': 'Is that something that I have time to do or should I come back after additional comment?'",
        "'speaker_1': 'You have a minute and a half left.'",
        "'speaker_2': 'Okay. I'll, I'll, I'll close my comments by saying I'll read in the exact or maybe the city clerk can read in the exact language. But I think that my goal today would be to make a minor change, which has been run by the city attorney, Mr. Koons Development Services and others, to ensure that it would still abide'",
        "'speaker_2': 'by what we're trying to accomplish and be in alignment with community input. And that would be that on page 69, the new subsection 5.3.9 adds in the section as follows Transition between existing zoning and specific plan districts that the land use regulation of the specific plan shall be effective immediately upon enactment, subject to the following four parcels'",
        "'speaker_2': 'under ten acres. The land use permitted by the existing Zoning and Plan Development District within the plan area prior to the effectiveness of the specific plan shall continue to be permitted in a manner allowed by the existing zoning or Plan Development District for a period of I hear the community asking for 15 years I'm open to.'",
        "'speaker_2': 'Putting in 15 years in that slot. I recognize that some leases can last up to, as he said, 30 years. But this would not just be for the gentleman who called in plan. It would be for all parcels along that corridor that are ten acres or less.'",
        "'speaker_2': 'Many of them already have long term tenants and would not be subject. But should those tenants become bankrupt or go under in the next few months or year because of this, then we would give them that opportunity to fill with a like tenant so that they could then recuperate and gather the necessary capital to make significant and'",
        "'speaker_2': 'transformational improvements to the corridor. Thank you.'",
        "'speaker_0': 'And that's a compromise that part of a broader motion than that first motion.'",
        "'speaker_2': 'It is the city clerk has the language. I don't know if I should read it all in or if they would like to read it in. I read in the component that I thought was most important.'",
        "'speaker_0': 'Mr. City Attorney, is that a line? I mean, I'll ask for a second in a minute, but does that align with how we've got to have the motions yet?'",
        "'speaker_5': 'Mayor We're going to have to hear the entire text that the Councilwoman was referring to, because it would be a change to the specific plan itself. So the Council needs to know precisely what do we have?'",
        "'speaker_0': 'What are we ready for the record?'",
        "'speaker_7': 'Councilwoman and councilwoman, if it's helpful, we have it here at the staff table and we can also assist you in providing that or reading that to the whole council.'",
        "'speaker_2': 'I can read it from the top. I just knew I was out of time. So if the council will oblige me to read it, I'm happy to do that.'",
        "'speaker_4': 'There. If I can challenge it up for a second. It's it's in my district, too. And if you need to, I will allow some of my time to the council and so she can read it all.'",
        "'speaker_0': 'Yeah, let's, let's just go ahead and have Councilman Manga read the rations. It's important for the motion. I think there's also any objection. Go ahead, Councilwoman.'",
        "'speaker_2': 'So the beginning of this starts. Per City Council Instruction staff proposes the two following amendments to the Globemaster corridor specific plan prior to adoption by the City Council on May 18th, 2021, as follows one on page 69, a sentence is added immediately following the second to last paragraph of subsection 5.2.2 as follows.'",
        "'speaker_2': 'Land use is permitted by the existing zoning and planning development districts within the plan area. Prior to the effectiveness of the specific plan shall continue to be permitted in a manner allowed by the existing zoning or planned development district for a period of 15 years.'",
        "'speaker_2': 'From the effective date of the specific plan as further detailed in subsection 5.3.9 of the specific plan on page 69. Number two on page 69, new subsection 5.3.9 is added as follows. 5.3.9 transition between existing zoning and specific plan districts.'",
        "'speaker_2': 'The land use regulations of this specific plan shall be effective immediately upon its enactment, subject to the following four parcels under ten acres. A The land use is permitted by the existing zoning and planning development districts within the plan area.'",
        "'speaker_2': 'Prior to the effectiveness of the specific plan shall continue to be permitted in a manner allowed by the existing zoning or planned development district for a period of 15 years. From the effective date of the specific plan of this specific plan B notwithstanding the above, no parcel shall be allowed to serve as container storage.'",
        "'speaker_2': 'See uses permitted by the specific plan but prohibited by the existing zoning or planned development district shall be permitted upon the effective date of the specific plan and shall supersede the prohibitions of the existing zoning or plan development district D.'",
        "'speaker_2': 'At the end of the 15 year period, any land uses not conforming to the specific plan shall be subject to Chapter 21.27 non-conformity of the Zoning Regulation three on page 124, add a sentence immediately following the last sentence of subsection 8.2.3 as follows When projects require additional seek or review, the city will coordinate potential transportation mitigation measures'",
        "'speaker_2': 'with the adjacent jurisdictions. And I think that I also want to just comment that considerable work by Councilmember Odinga's office came into play. Him and I were blindsided by a staff decision this year that allowed container storage on a parcel not outlined in my exemption today.'",
        "'speaker_2': 'But as we are both very cognizant of that impact on the residents, we are adding that additional restriction against container storage that we thought was clear but may need to be outlined very specifically. That is why I added Section C to ensure that Kim and I are never placed in that position to have to dismantle something that'",
        "'speaker_2': 'should have never happened in the first place and is not within the support of the community that we represent. Thank you. Thank you for your partnership, Councilmember.'",
        "'speaker_3': 'And.'",
        "'speaker_7': 'Mr. Mayor or Councilmember Mongo in discussions we had with Councilmember Mongo. There's also a technical amendment needed to be made, which is number four, which has to do with coordination with the city of Signal Hill as well as Lakewood into the future.'",
        "'speaker_7': 'So if it's acceptable, we'd like to also include that language.'",
        "'speaker_2': 'Thank you. Page four, page two. Yes, thank you. Number four on page 124, new subsection 8.3.3.1 is added as follows 8.3.3.1 coordination with adjacent jurisdictions. During the development review process, the city shall coordinate with adjacent jurisdictions, primarily the cities of Signal, Hill and Lakewood, on a project specific basis for all projects requiring a traffic impact analysis and'",
        "'speaker_2': 'subject to site plan, review or other discretionary land use approval in accordance with Long Beach Municipal Code, Chapter 21.25. The purpose of this coordination shall be to identify transportation improvements that could take place in the adjacent jurisdiction or jurisdictions to mitigate traffic impacts within the framework of the established mitigation measures.'",
        "'speaker_2': 'The city may additionally commit to pay a fair share portion of these improvements within the adjacent jurisdiction or jurisdictions. Thank you, Mr. Cootes. I was excited and didn't get to page two. I guess I'm not qualified to be the city clerk yet.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Ah, we are Mr.. Mr. City Attorney. Anything else you needed from that?'",
        "'speaker_4': 'It's perfect, Your Honor.'",
        "'speaker_0': 'Okay. And Catherine? Ringo.'",
        "'speaker_4': 'Thank you, Mary. And I want to thank Councilman Mungo for being so thorough on her research and discussions that we had and I also had with the development services staff in regards to this project and its impacts on the community.'",
        "'speaker_4': 'If staff would go back to slide number seven again, please. Sorry. It's late night. It's late. Okay. Now, you only see this slide that there's a Cherry Avenue overlay, and that's the property that we're talking about. And those are the ones that basically affected us the most.'",
        "'speaker_4': 'When Councilmember Mungo was talking about the surprise that we got late last year into this year with the container traffic that was there, that included a lot of noise. And it was that became a 24 hour operation beyond what we knew about.'",
        "'speaker_4': 'And it was because it was done over the counter without our or our understanding of what was taking place there. But the main purpose of had this map up is that you'll see to the upper left hand corner or that that section that's all residential.'",
        "'speaker_4': 'And the impact that this development's going to have on the residents there is going to be quite, quite impactful for them. And they're very much interested in concern as to what is going to be taking place here. So the changes that Councilmember Wingo has put in there is to address a lot of those concerns and of course'",
        "'speaker_4': 'dealing with the other cities that are also impacted by this with cities in Lakewood and Signal Hill. So it's very important that they also have interest in this. And and also the to what we are concerned about in the city alarm each one of the more important issues that was put in place up there and I know'",
        "'speaker_4': 'it's very impactful to the neighbors up in the in that area is called the heights and the criteria and that's the parking impacts that will be addressed on there. So one of the questions that I have is what what is going to be the parking impact of the development center?'",
        "'speaker_4': 'There are up and down that corridor. And what is the rationale behind the parking that that is going to go in place there? Because obviously there's impacts not either with the businesses that are there and with the upcoming development, there are going to be future impacts.'",
        "'speaker_4': 'So I'd like to hear more from staff in terms of what rationale are they looking at when it comes to parking.'",
        "'speaker_7': 'But thanks, Councilmember Christopher Koonce from Development Services. So as you know, we've been working with constituents in your district because the property, the district five, but the residents surrounding are in District seven. So we've been working on this about five years, six years, and we had a lot of meetings and some things that were really important to'",
        "'speaker_7': 'the residents was they want the visual character of Cherry Avenue improved. They want goods and services. And then in terms of the businesses, they want higher value businesses, they want high quality buildings. They want next generation manufacturing space uses, R&D uses, and they don't want sort of dead warehousing.'",
        "'speaker_7': 'So very similar to what we've been able to accomplish on the other side of the airport in Douglas Park. That's always been sort of the vision for here, but also with some more kind of community scale retail over time.'",
        "'speaker_7': 'So in order to achieve that outcome, we have to look at what the regulations are doing in terms of the building. So because warehousing is at a relatively low parking rate and office can sometimes be at a higher parking rate, you can inadvertently discourage the office uses the higher end users that you're trying to attract if you'",
        "'speaker_7': 'set the parking requirement too high. So we know that parking is area of concern and a sensitive issue here in the city. So we actually had a consultant report that claimed that we should not have any additional parking required for office uses that were part of these larger buildings, that that should just be sort of a bonus'",
        "'speaker_7': '. We took the community input, which was to not do that. We balance that and came up with a number that was appropriate for these very large buildings. In our experience, the number that we came up with is about what is actually used in other such facilities around the city, including over in Douglas Park, and we'll be more'",
        "'speaker_7': 'than adequate parking. So every new construction job that comes in there is a reevaluation of the parking. And we look at what the parking demand is, the square footage, and then we go through the process on that. So we were trying to balance a bunch of different factors, not just the numerical number of parking spaces, but the'",
        "'speaker_7': 'type of uses we're going to get and what we heard from the community in terms of what they want to look like and the type of users they want and the district.'",
        "'speaker_4': 'Thankfully, our response is obviously it's very important to that community in that area. And I'm glad that you're paying attention and listening to what their needs are. I hope that day in the future you will be paying attention to that need.'",
        "'speaker_4': 'The other question I had is that there was during the presentation you also talked about the coordinated efforts that we will have with the Hill and partly Lakewood in regarding to bike lanes. What can we expect to have in terms of bike lanes along Cherry Avenue?'",
        "'speaker_4': 'Is it on both sides of the street? Just one side of the street? What is going to be, in your view, the impact for the community? And how can they stay involved in the development of the project as it goes where they are?'",
        "'speaker_0': 'Sure.'",
        "'speaker_7': 'So, Councilman, our long term vision is to be able to have bike transportation. And ideally, that's on both sides of the street. But that depends on final design. So it may not be on both sides of the street or there may be an interim condition where one side of the street is different than the other.'",
        "'speaker_7': 'So what's what's going to happen is this plan establishes a vision that establishes what we want cherry to look like in the future, but that's not tomorrow. So we have to do work development services with public works about actually engineering that street.'",
        "'speaker_7': 'And that is going to happen sort of based on when properties turn over and how we're able to fund that transformation. And that's all done in partnership with community. So Cal Heights did submit that letter with some concerns about, you know, sort of what's the interim condition on the bike and the exact bike routing and how it'",
        "'speaker_7': 'transitions as you reach for a five freeway. I don't have the answers on all of those because that is yet to be determined, but it will be determined with community in an open process and there'll be a lot of engagement and ability for folks to participate and then to make it.'",
        "'speaker_7': 'More complicated but also important. You know, Lakewood has a chunk of property on Terry that has Long Beach on either side and then to the south as well as to the west, we have signal hill. So we have to coordinate with both of those cities.'",
        "'speaker_7': 'We have a lot of shared goals, but also have some differences and may have some differences of opinion about, you know, the streets and they're welcome to treat their portion of the street differently. We just need to have a clear, understandable transition between the two different approaches.'",
        "'speaker_7': 'So all of that work is in front of us, but we'll be involving your office and your constituents as we do those refinements.'",
        "'speaker_4': 'Thank you very much. Appreciate it. And one last question was Councilmember Mungo mention the 15 year lease agreement, or at least the proposal in there? Is there anything magical? About 15 years going to be less than 15 years.'",
        "'speaker_4': 'I'm thinking maybe five. Is there is that out of the realm of reality? Or please, could you explain the the the process on 15 versus five or ten?'",
        "'speaker_7': 'That's a policy discussion. So I don't want to speak for a council member. Mungo here at the staff table, we can make that number whatever you want to make that number eight. Every year. Flexibility provides additional flexibility to that property owner and I understand and respect that goal.'",
        "'speaker_7': 'At the same time, the community did want to see this transition occur over time and every year that's added is perhaps delaying that transition and delaying kind of the goals of what community members and others expected to see along the Terry corridor in this real property.'",
        "'speaker_7': 'So typically phase ends would be shorter and year a couple of years. But they can be long. There's no. There's no limit in either direction. It really is a policy call for this council to make and will implement whatever decision you make.'",
        "'speaker_4': 'Councilmember Mongo Would you be amenable to a substitute motion but you're afraid that they'll put in the amendment to make it five years as opposed to 15?'",
        "'speaker_2': 'So I guess I'd have two questions for staff. I agree that we want to implement what the community is looking for. I think that in reaching out to the land owners in that area, some really good points have been made.'",
        "'speaker_2': 'The car wash is not going to change for 30 years. The two adjacent businesses are not going to change for likely 30 years. And specifically, if you could pull up the slides again. If you look at. I think it's Slide ten.'",
        "'speaker_2': 'I guess I'm unclear if the community wanted this. Perfect. Nine. I'm sorry, said nine. If the community wanted Cherry to look a certain way, why wasn't that Cherry Avenue overlay zone applied to both sides of the street? I mean, why the rush to get one side of the street modified, but leaving the other side of the street'",
        "'speaker_2': 'without any overlay.'",
        "'speaker_7': 'So the check the Terry Avenue overlay is different than the retreatment of Terry. So the Terry Avenue overlay actually allows additional uses that would not otherwise be allowed in the business park. But the difference between the two sides of the street is the difference between the two sides of the street.'",
        "'speaker_7': 'So on the east side you do have some industrial uses, but you also have the carwash is actually a commercial use. The Enterprise Rent-A-Car is a commercial use. So the character of the two sides of the street were different.'",
        "'speaker_7': 'And that was reflected in the plan, which is based on, you know, all of the different meetings, but as well the economic analysis and all the different factors that went into the plan. So yes, there's two different approaches on two different sides of the street, but it's meant to balance all the different input that we received and'",
        "'speaker_7': 'all the different factors. And then the community is also getting, you know, treatment of the street itself within the public right away. So that character will change sort of regardless of the businesses.'",
        "'speaker_2': 'So there are multiple parcels which are currently in the business park district, community, commercial district, Cherry Avenue Overlay Zone that are currently industrial. And those were not given the opportunity to stay. General Industrial District. And yet the ones directly across the street from them are.'",
        "'speaker_2': 'So I don't understand. Well, if the community wants the they'll look to change. Wouldn't they want the look to change on both sides.'",
        "'speaker_7': 'And the community input was one of many factors is what staff is trying to communicate to you. So the existing land uses were another factor. But I just want to be very clear. So everyone in council understands, you know, whether it's one year, two years, five years, 15 years, 35 years, that's the amount of time to establish'",
        "'speaker_7': 'a use. So once a user is established and they've been issued permits, they have non-conforming rights, they can exist into perpetuity. They can exist for a thousand years. So what we're talking about is how much time should be given as a transition period to establish a use not there.'",
        "'speaker_7': 'When the zoning changes, no existing permitted business has to go away. We don't do that. We don't set businesses down. They are able to operate so long as they operate in that location.'",
        "'speaker_2': 'But I think what the constituents on that corridor that have financial interest in the area have communicated is if the complete opposite side of the street is maintaining its industrial status and the neighbors. To their south are maintaining their industrial status, their ability to sell their potentially new use to a and I don't want to name any'",
        "'speaker_2': 'specific business and get the community excited but is less because some businesses may not necessarily want to be next to a um, industrial site. So an example might be and Councilmember Austin's done a great job of having a Trader Joe's that's a commercial use, but a Trader Joe's is never going to go next to an industrial use'",
        "'speaker_2': '. And so when you have limiting factors based on who your neighbors are, I agree that, yes, the amount of time does not matter, except for that you almost have to outlast some of your neighbors in to the point at which you either can buy them or they want to conform to the use.'",
        "'speaker_2': 'And if you have someone that will be there in perpetuity, it really limits the adjacent neighbors ability to be successful in bringing in the highest and best use for the residents. So yes, I am open to a reduction in the number of years this dialog has been very fruitful.'",
        "'speaker_2': 'We have a pretty amazing broker that has been looking in my district for a facility for quite some time and through this dialog I've connected them with some of the property owners on this corridor and I hope that that could result in something that the community is really excited about.'",
        "'speaker_2': 'But I also know that exploring that could take up to two years, which would then leave them in a place where if the amount of time available was too short, they might not be able to get a long term client.'",
        "'speaker_2': 'So if Mr. Otunga instead of I know that one of the parcels requested 15, I know in talking with some of the community members they had bigger ambitious numbers, which I thought were much too high in the twenties.'",
        "'speaker_2': 'Would you be amenable to, let's say. How about ten years? That would give them an opportunity for a five year lease with a potential two year option to explore that could potentially expire during that term. Are you comfortable with that?'",
        "'speaker_4': 'Yes and no.'",
        "'speaker_2': 'Okay. What are you most comfortable with?'",
        "'speaker_4': 'Well, then you just find the. The the part that I have. Problems are issues with is what happens afterwards when it becomes a non-conforming use.'",
        "'speaker_2': 'It made them have that right.'",
        "'speaker_4': 'Yeah, we do. And, but if we, if, if we could address that to the point where like it doesn't become non-conforming anymore, we is like something's got to happen in that area in regards to that, those properties. One of the issues that I have, for example, that I have an issue, I have an item coming up later'",
        "'speaker_4': 'in in tonight's agenda regarding the zoning. And that's one of the biggest issues that I have, is that there are some properties along some of my business corridors that are non-conforming and they will stay like that forever. And it creates barriers to other types of development.'",
        "'speaker_4': 'And, you know, I don't know if there's a fix for that, but that would be then that becomes the barrier to all other types of development that we would want to see along these types of corridors. So I mean, and that's a conflict where I'm at the quandary that I'm in is that I'm not opposed going from'",
        "'speaker_4': '15 to 10. I would prefer less, obviously, because that way I don't I don't pass on that type of issue concern to my successor whenever that happens. But at the end of the day is that we all have that issue, we'll have that problem.'",
        "'speaker_4': 'But I think we need to fix that somehow so that we have greater flexibility in getting the types of businesses that our neighborhood serving as. An example, like I mentioned earlier, just north of the area that we're talking about, northwest of it is a big residential area that would benefit greatly from other types of development, like you'",
        "'speaker_4': 'mentioned earlier that we're not how to get people excited but but I mean it is a type of of development that is much needed in that area and that would be very successful, I think. But if we create barriers to it like, like establishing a, a non conforming use, then they're locked and they're locked it.'",
        "'speaker_4': 'And I can understand the, the concerns of those owners that are there now. Family owned pass pass on to their kids and grandkids and perhaps even great, great grandkids. But you know, how or how long can it be non-conforming and how long will it be non neighborhood service.'",
        "'speaker_4': 'So that's that's the quandary and I'll there was this and I don't know if Stapp has an answer to that or or we're just sort of stuck between a rock and a hard place right now.'",
        "'speaker_0': 'Um, Clark, are you. Are you following the time? I know there's other folks queued up, and I just feel like we're not following the time limits. Or can you please make sure that we are doing that?'",
        "'speaker_1': 'Yes, we are timing the council member.'",
        "'speaker_0': 'Okay. And I just I want to go back to folks that are cued up. Also, I have a couple questions as well.'",
        "'speaker_5': 'Councilman, your on.'",
        "'speaker_0': 'Over your anger. Can we get an answer to his question first?'",
        "'speaker_5': 'Yes. Councilman, your anger. It's Mike Mays. The issue with non-conformity is is covered by a separate chapter in the zoning code. And that's something that's not before council tonight. That would take a whole other policy discussion. So there's really no way this evening that we can do anything to address the issue of our situation with existing nonconformity'",
        "'speaker_4': '. Thank you. Maybe that's a cop with a future. I could pass it on now.'",
        "'speaker_0': 'Thank you. So just because I want to clarify just for myself. Do I? I love everything, I think. Councilman Bongo Guthrie, Ringo, you guys did a great job on this. This is a really, really critical, specific plan. I just want clarification.'",
        "'speaker_0': 'On. And I'm not sure if you were referring to this a moment ago, Mr. City Attorney, but Mr. Monica or some of the Roman services accounts as it relates to the one year initial recommendation, that's part of this proposal that's being currently contemplated to be changed, correct?'",
        "'speaker_0': 'The recommendation is one year. So on the non-conforming. Correct.'",
        "'speaker_7': 'Mr. Mayor? A it's a policy call for the council. So I know I personally have had to go. Yeah, let me but let me let me answer your question, please. So we prepared a specific plan based on an economic analysis that shows that this transition can happen quickly and that no transition period was necessary.'",
        "'speaker_7': 'I then in the preceding days have had discussions with a couple of council members about this issue, and their desire was to provide some additional flexibility to small property owners because the effects of COVID were obviously not accounted for in the economic studies we did in 2018 and 2019.'",
        "'speaker_7': 'Totally valid. So our job as staff was to provide them some language and some options to do that. I had discussed the one, two, two year time frame with with different parties, but I'm not going to go into the private conversations.'",
        "'speaker_7': 'But the plan that was prepared and approved by the Planning Commission doesn't include any extra a transition period. But when asked how that would be accomplished, I provided language and the ability to accomplish that. Now, the period of time, that's a policy call for council and you have to weigh the longer the period of time, the more'",
        "'speaker_7': 'beneficial it is to property owners that need more time. The shorter period of time, the more beneficial it is to accomplishing the goals of the plan and to the community. Seeing, you know, sort of the land use vision that they had talked about in all the meetings that have occurred over the years.'",
        "'speaker_7': 'So how you strike that balance? We're glad to assist you, but that's really that's a call for the council.'",
        "'speaker_0': 'And mayor and council member. Just to just clarify and reiterate, we're not talking about the non-conforming status. The properties will remain in a non-conforming status. What we're really talking about is allowing a few additional years to allow those property owners that are perhaps willing to or want to make a change to be able to comply under the'",
        "'speaker_0': 'existing zoning, not not the the new lands designation. And I'm and I'm trying to just get comfortable with the amount of additional years so I and I can be convinced. I'm hearing, I think, Councilwoman Young making some good some good points.'",
        "'speaker_0': 'But I just because I you know, I'm just trying to understand of the whole the community process as I understood it, and the desire for the neighborhood, the surrounding neighborhoods and the area to see change is is why the recommendations were made as you presented them.'",
        "'speaker_0': 'And so I, I just can I that they're going to do ten years which which to me seems. Significant, specific plan to go from a one, you know, 1 to 2 or ten seems significant. So I'm trying to understand maybe maybe this is just a very small group of businesses.'",
        "'speaker_0': 'Maybe maybe this wouldn't actually impact the area much. And I think Council Mango and customer Ranga kind of understand probably the decline probably more than I do because they've been work, they've been knee deep in it. So maybe Mr. Coons or Mr. Modi, if you want to explain to me just the number of businesses this would actually'",
        "'speaker_0': 'impact, this actually has changed.'",
        "'speaker_7': 'So, Mr..'",
        "'speaker_3': 'Mayor.'",
        "'speaker_7': 'This impacts numerically a large number of parcels. But I believe, based on the information we have, that it actually only affects the speaker that that spoke to. No. And possibly one or two others, because they have a situation where they have a vacant or soon to be vacant piece of property that they're trying to lease right now'",
        "'speaker_7': '. And they're concerned about the rules changing from under them at a challenging economic time. So there are other properties that would be subject to this rule, but they're fully leased or they're pursuing uses that are enabled by this specific plan.'",
        "'speaker_7': 'Now, that said, you know, the property that that's most impacted is there at the corner of Cherry and Wardlow, and that's where you have an Enterprise Rent-A-Car and a car wash today, if you're familiar with the location.'",
        "'speaker_0': 'Yep, yep, yep, yep, yep. Okay. So so it sounded like staff is not overly concerned or there is not a concern with going to the ten year as it relates to developing the specific plan in the appropriate way.'",
        "'speaker_0': 'Just want to make sure that staff you keep saying it's a policy decision and I appreciate that. But policy decisions have impacts so that the staff is comfortable with that number. I only I only ask because that has not been the that the input that I receive when you when I this has been presented to me, this'",
        "'speaker_0': 'is very different than what's been presented. So can staff you're comfortable with that?'",
        "'speaker_7': 'So, Mayor, we are comfortable with ten years or you know, we're trying to balance really hard things, right? So we're in an economy that is in a period of transition and change. And if this plan was in front of you two years ago, we would have not recommended any transition period at all.'",
        "'speaker_7': 'But we're trying to accommodate what is truly an unprecedented difficult situation for some of the small property owners, while still accommodating our goals and for the large parcels, we expect projects to be entitled this calendar year and for you to see new, exciting companies employing hundreds of thousands of people during calendar year 2022.'",
        "'speaker_7': 'So it's I don't want to lose sight of what this plan is and how important that is and being able to embrace those space related uses. So in order, you know, staff is comfortable with providing additional flexibility to those small property owners based specifically on the unprecedented place that the economy is in in this exact moment.'",
        "'speaker_0': 'Okay. And. All right, I'm just trying to wrap my head around it just because we don't normally don't provide this amount of time in these instances. But I'm going to you know, I think that Councilmember Mongeau and Councilman Ranga have been working on this.'",
        "'speaker_0': 'It's this is the changes is news to me. So I'm just trying to understand it. I know, broadly speaking, with these specific plans, this is the type of we try to avoid these types of extensions. But I understand.'",
        "'speaker_0': 'So I'm going to go ahead and not I'm not going to have any objections to it. So I will support whatever it is that comes from manga and country. And I want to do.'",
        "'speaker_3': 'This with this change.'",
        "'speaker_2': 'But thank you, Mr. Mayor. And we're also trying to mitigate something that's worse for the community, which council member Austin has always been a great proponent of is vacant lots. And we know that as the economy is changing, we just want to avoid that at all costs and particularly in this area.'",
        "'speaker_2': 'The shapes and configurations of those lots have been unique and we've had some of the land owners combine them over time, which has been helpful, but in the way in which they really need to be united for a vision that will best serve the new industry being proposed and that many businesses are fighting for behind it.'",
        "'speaker_2': 'It's going to take some time to pull all those complicated, complicated proposals together during the time when the economy is striving, but inflation is going up. And we need to ensure that the businesses can get the capital to make the investments to do something amazing and not just what they can afford to do today.'",
        "'speaker_2': 'So I appreciate the leeway that you're giving. We've done a lot in the last 48 hours, and I could not have done it without Mr. Kunze, this partnership and Mr. or Councilmember ordering us partnership. So it's been a long road, but and some late hours the last night and a half.'",
        "'speaker_2': 'But I think we're there if everyone's comfortable.'",
        "'speaker_0': 'Thank you. I appreciate that. It comes from Austin, Texas.'",
        "'speaker_5': 'Answer woman mango juice for clarity. Did you accept the friendly made by councilman your anger for ten years for the transition period? Yes, sir. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Austin.'",
        "'speaker_4': 'Wow. Thank you so much. And, you know, I do appreciate all of the work, particularly by my colleagues, Councilmember Mongo and Eurogroup for, you know, getting us here. But obviously the the the development service and planning staff were there many, many hours and hours of extensive community outreach to get to this.'",
        "'speaker_4': 'Very, very. Thick and thoughtful plan. I'll just say that it's it's quite a bit you know, I support the goals of this this plan. And there were five goals laid out early, you know, and three of the five of them are are jobs related.'",
        "'speaker_4': 'And, you know, the fire and the motor that got me to run for city council actually takes me back to the site, McDonnell Douglas Boeing site. As many of you know, I was employed there for 14 years, you know, right out of high school.'",
        "'speaker_4': 'And, you know, I want to challenge some of the numbers there because, you know, at our height, this is a place that in the 20th century had over 40,000 employees there. Right. And the C-17 site specifically had well over 10,000 at one point in probably the early to mid nineties.'",
        "'speaker_4': 'And so my my objective and I'm going to support what's on the floor here is to restore a vibrant job sector. And I think this this plan actually does that I want to just point out historically and it's always been an employment district, if you really want to look at the history there and not the thousands and'",
        "'speaker_4': 'thousands of good middle class quality jobs, union jobs, many of them that were were created and and that allowed for employment there, which had a direct benefit on every aspect of our city through our economic development, all of the small businesses, our housing market, Long Beach thrived as a result and the region thrived as a result of'",
        "'speaker_4': 'those those those great jobs that were were there. And so this is an opportunity, I think this planning document gives us an opportunity to, I would almost say, restore the employment district and the opportunities that we once had there, because we are if we were honestly honest with ourselves, we're operating from a jobs deficit right now.'",
        "'speaker_4': 'When we look at what we lost with our aerospace industry in the nineties and most recently Boeing as well as the shipyard jobs that were lost here during that period of time where the jobs deficit. And so we need it.'",
        "'speaker_4': 'We need a comeback and we need to be as aggressive as we can possibly be as a city council to do that. And so I think the. For those reasons. Obviously, I support this plan and I appreciate the thought that both my colleagues, Mongo and Urunga, have put into, you know, mitigating the concerns of other small property'",
        "'speaker_4': 'owners and residential impacts as well. I would just say also that, you know, some of the air studies and documents like traffic issues, there shouldn't be a concern again, because we had those issues. Right. We had several thousands of people, three shifts, 24, seven in and out of that that matter at that location.'",
        "'speaker_4': 'And it was impactful. But I think impactful in a positive way. And I certainly hope we can get back to that very soon. Thanks.'",
        "'speaker_0': 'Thank you, Vice Mayor Richardson.'",
        "'speaker_3': 'Thanks, Mr. Mayor. Just wanted to just chime in. I, I completely agree with Councilman Austin about the way we should be thinking about this. We think big picture this. You know, this plan sets the foundation for what the future could look like for our city.'",
        "'speaker_3': 'And there are a number of things taking place across our state, across our region that could potentially bode really well for Long Beach. Given how close we are to the port and our workforce, our college, our educational institutions, the electrification of our entire transportation network is about to happen very, very soon.'",
        "'speaker_3': 'We already have some history of aerospace manufacturing, and we have automotive manufacturing right here in the city. T ABC, Toyotas and Teslas are built in our city. We don't we don't know. You know, a lot of us may not know that this creates a big opportunity for us.'",
        "'speaker_3': 'And let's not lose sight of that. We also have a major expansion creation of renewable energy, just general, generally clean technologies. That's where we should be thinking as we should be heading. The fact that we have this plan in place, that this plan is getting into place, I think both well, for the for the entire city.'",
        "'speaker_3': 'So I want to say good word to both the council members who take the time to make sure that this vibes and aligns with the interests of the neighborhoods, but also are taking on this discussion point for all of us.'",
        "'speaker_3': 'Because, you know, if this goes well, all of us, all of our communities, whether we have, you know, jobs or educational attainment levels or whatever it is, we're all going to benefit from what happens here. So do you want to chime and say, I'm happy to support where, you know, where we land with this motion as long'",
        "'speaker_3': 'as we just keep in mind, you know, how important this space is to our broader regional economy. Thanks.'",
        "'speaker_0': 'Thank you. We're going to go to a vote before we go to to our vote, we have emotional. We have to determine how many votes we have to take on this.'",
        "'speaker_5': 'Despite separate five separate votes, Mayor.'",
        "'speaker_0': 'Okay. So before we go into these into the five separate votes, I did want to add that I, I didn't earlier with some of my questions that I just think overall, this is a really, really just historic, I think, plan for the whole area.'",
        "'speaker_0': 'And I want to just uplift what a lot of what Councilman Mongeau said. And Councilmember Austin, because we were in this plan, I know the staff has been working on really, really hard and a lot of us have been working on pieces of this plan, including the advocacy around land use for for many, many years after.'",
        "'speaker_0': 'So to see it all come together. I just want to thank the entire staff and team. They worked really hard on this for many years. All the community members that have been involved, the property owners, the neighborhoods. And it is a great opportunity to really uplift the growing space economy, to uplift our aerospace economy that are such'",
        "'speaker_0': 'important parts of our city and really just improve just that whole portion of our city which which needs so a lot of love and investment. So a great work for everybody and just a really, really great plan. So with that, let's go and take each vote.'",
        "'speaker_0': 'Madam Clerk, do you want to read the the what we're voting on and then we'll go a roll call for each one. Take it away. Thank you.'",
        "'speaker_1': 'First vote is adopting a resolution certifying the final program of the air. Councilwoman Sandy has. Councilman Allen.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Councilman Price. I councilman's a banana.'",
        "'speaker_3': 'Right?'",
        "'speaker_1': 'Councilwoman Mango.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Councilwoman Sarah. I council member. Council member.'",
        "'speaker_4': 'Oranga I.'",
        "'speaker_1': 'Councilmen Austin.'",
        "'speaker_4': 'Hi.'",
        "'speaker_1': 'Vice Mayor Richardson?'"
    ],
    "Resolution to Amend the Master Fees and Charges Schedule.": [
        "'speaker_0': 'Go ahead.'",
        "'speaker_1': 'That concludes the item.'",
        "'speaker_0': 'Thank you. Item 22.'",
        "'speaker_1': 'Item 22 is report from financial management. Recommendation to receive supporting documentation and to the Let the record conclude the public hearing and a DAB resolution amending the master fees and charges schedule city.'",
        "'speaker_0': 'I'm not sure on the second. Do we have a mr.. Mr.. Mr.. MODICA, do you have any report on this or are we just moving forward?'",
        "'speaker_5': 'Okay.'",
        "'speaker_6': 'We don't have to. We can go straight to comments if there are any. We did a huge presentation on this as a study session about two weeks ago on the on the general philosophy. And we're available to answer questions now.'",
        "'speaker_6': 'If there's any specifics.'",
        "'speaker_0': 'I don't think it's any I don't think is any public comment. Correct, Madam Court.'",
        "'speaker_1': 'There's no public comments on this item.'",
        "'speaker_0': 'Okay. Let me go to Councilman Pryce, who has the motion.'",
        "'speaker_2': 'Thank you, Mr. Mayor. Just a couple of questions I wanted to ask staff. Can someone from the staff talk about the public outreach or noticing requirement that was effectuated for this item?'",
        "'speaker_5': 'It looks.'",
        "'speaker_4': 'Like. Mean to do now.'",
        "'speaker_2': 'I'm sorry. Can you hear me? Yes. Councilman. Councilmember.'",
        "'speaker_1': 'Hi.'",
        "'speaker_2': 'Yes. So, noticing requirements. I went out 14 days in advance of the hearing. This is within California state law and it went out via on our website posted as well as I'm posted on facilities and emailed through those interested parties.'",
        "'speaker_8': 'To the city clerk's office.'",
        "'speaker_2': 'Okay. And I just wanted to confirm that the master fee schedule that we're voting on today still has in place discounts for youth, seniors and nonprofits so that they're not going to be charged at the same rate as the general public or for profit organizations.'",
        "'speaker_2': 'There are no changes that were presented as part of the May or April six and the May 4th presentation. So those are still included. Okay. Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman Bryson. And that's a motion, councilwoman.'",
        "'speaker_2': 'It is. Thank you.'",
        "'speaker_0': 'Okay. Vice Premier Richardson.'",
        "'speaker_3': 'So just a couple comments. So so one thing that really stood out to me and I want to lift up, I was encouraged by the airport shuttle pick up and drop off these guys. All so so. Fleets with at least 25% of cleaner vehicles are per hour.'",
        "'speaker_3': 'Murphy has reduced 25%. Whereas if you have at least five vehicles and 75%, clean air vehicles is reduced by 75% using price in the clean the air thing. I think it's great. I think it's great that Long Beach is doing this and I think it needs to be lifted up.'",
        "'speaker_3': 'And also, I'm heartened by the consideration or comments last time you all weighed in and you know, I spoke to, you know, you and a number of people talked about youth and parks. I was glad to see that, you know, a lot that that was considered and what's what was brought forward to us.'",
        "'speaker_3': 'So I'm happy to support what's in front of us. Thanks.'",
        "'speaker_0': 'Thank you. Council member Austin.'",
        "'speaker_4': 'I support the item. I was queuing up to the motion, but I think our staff has put in a lot of our work. I mean, obviously the council has has reviewed these schedules and had the opportunity to review them for a few weeks.'",
        "'speaker_4': 'Now I'm prepared to vote.'",
        "'speaker_0': 'Thank you, Councilwoman Mongo.'",
        "'speaker_2': 'I want to thank that's where Richardson for his compliments. I've worked on the Clean Air Vehicle Incentive for three years. It has not been without its struggles and looking for a way to recognize the impact of those vans on the neighborhoods around it.'",
        "'speaker_2': 'Mr. Mayor, Garcia and I have worked hard to become the cleanest airport in America, and I think that clean vans is a step in the right direction. We did something meaningful with taxis many years ago, and I think the vans is the next step that we needed to get to, and I look forward to getting those fleets'",
        "'speaker_2': 'in line. I did have some questions. I met with every department head and that we had questions with and I had some questions related to some of the fees in here that staff had some information they were going to research and get back to us.'",
        "'speaker_2': 'On whether or not certain fees were set by the county, specifically with a mandate that we charge fees that are lower than our costs, which the county would then be creating a an unfunded mandate. And so I was just reaching out to health services to see if they got an answer to that.'",
        "'speaker_2': 'I know it's been about a week. Have you? I know there's a lot going on.'",
        "'speaker_8': 'I can't remember. Yes. The the the fee for specific to vital records, which was the conversation we were having is set in the state health and safety code. We can't charge more than the base rate. The remainder of the costs that are in this fee study are related.'",
        "'speaker_8': 'That's the $28, the additional costs, the expedited emergency weekend and others are are not established specifically. We do have some flexibility in those rates. However, the increases that were proposed, the conversation make us significant would be make us move higher than others.'",
        "'speaker_2': 'So just to be clear, they are state mandated. Therefore, that is an unfunded mandate and we have a process annually when we close the cap or to then pull out any unfunded mandates and forward those to the state for requests for reimbursement.'",
        "'speaker_2': 'And we're doing that with all of these final record. When we spoke, we didn't know even if the county was mandating it or the state. Now that we know that it's the state, can we ensure that it's a part of that annual closure process to potentially bring in that additional revenue?'",
        "'speaker_5': 'I will work with will work with the financial management team and look at that option.'",
        "'speaker_2': 'That's great. And for those department heads that aren't privy to this detailed conversation that Ms.. Colby and I had on any fee that is set by the state that exceeds our cost to provide it is an unfunded mandate.'",
        "'speaker_2': 'And there is an unfunded mandate, cost recovery strategy that is court regulated. And so we have that option. They often pay four or five years later, but it is still local funding that we should have available to our local kids.'",
        "'speaker_2': 'So thank you for doing the research. And even if it's only tens of thousands of dollars a year, tens of thousands of dollars a year over ten years, 20 years, it's a lot of money. And the more of those that we catch along the way, the better.'",
        "'speaker_2': 'We are representing our residents and able to provide those funds locally. So thank you for doing that research.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilman Ciro.'",
        "'speaker_2': 'You, Mayor. I want to thank staff for their hard work in getting this report together. I know that it takes a lot of staff time to review these fees, and I do want to address that. You know, I think that there's always a concern that I think our residents will have, various stakeholders will have with an increase'",
        "'speaker_2': 'in fee and also just, you know, having them hear this in light of the pandemic. Right. I think that that's my concern is we're talking about recovery and wanting to make sure we help businesses and residents recover and then all of a sudden we come out with our fee increases.'",
        "'speaker_2': 'Right. So I'm just interested in hearing how, you know, if we're going to be moving forward with these recommended fee increases. What will be the communication process, especially in sections where they have more than doubled and sometimes quadruple?'",
        "'speaker_2': 'They're very few cases. But I think it's just really important that we do provide information ahead so that in light of just the current economic situation we're in. Right. So I do want to be sensitive to that, where we're going to be announcing this in this in light of this condition, economic condition.'",
        "'speaker_0': 'Councilmember and Development Services. We don't automatically turn on the switch and start charging the new fees. We do provide public notice to our customers well in advance of the changes in fees to allow them the opportunity to come in and.'",
        "'speaker_7': 'Submit their their applications to us. And in light.'",
        "'speaker_0': 'Of COVID and our permitting, we will be very.'",
        "'speaker_7': 'We will.'",
        "'speaker_0': 'Allow enough time to for the community.'",
        "'speaker_7': 'To submit their applications with under the.'",
        "'speaker_0': 'Existing fees.'",
        "'speaker_2': 'Thank you as well as the other departments as well. And. And Health and Parks and Rec.'",
        "'speaker_3': 'That's Councilwoman Services. Brant Davis, director of Parks Recreation Marine, something similar to what director R.S. explained. We would also have a very proactive communication model in place through our website, our nature center, our community centers. And we'd also be reaching out directly to a lot of our stakeholders or community groups who have had a history and any'",
        "'speaker_3': 'type of event reservations. And so we will be very forthcoming during them. Plenty of notice of any anticipated increases above or beyond what they've been expecting historically. Thank you. Good question.'",
        "'speaker_2': 'Thank you. Appreciate that.'",
        "'speaker_0': 'Thank you. See no other council comment. We have a motion in a second. Please go ahead and do a roll call.'",
        "'speaker_1': 'Compliments. And they asked me. Councilman Allen, I'm Catwoman Pryce, I councilman supporter.'",
        "'speaker_3': 'Right.'",
        "'speaker_1': 'Councilwoman Mongo.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Councilwoman Sara i. Councilwoman. Councilmember Oranga.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'Councilman Austin.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'Vice Mayor Richardson.'",
        "'speaker_3': 'Yes.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Purchase and Deployment of Portable Basketball Hoops in the Second District.": [
        "'speaker_0': 'Thank you. All right. We're going to do all the funds transfer items together, which is item 24, 25, 26 and 32. So if I can have you please read all those, please.'",
        "'speaker_1': 'Adam, 24, is communications from Councilwoman Ellen recommendation to increase appropriations in the Parks, Recreation and Marine Department in the amount of 10,300 to purchase and deploy four new portable basketball hoops in the second District. Item 25 is a communication from Council Women's and they have Councilwoman Sara recommendation to increase appropriations in the city manager's department by 1000'",
        "'speaker_1': 'to provide a contribution to Long Beach, home living and work sense to support flavors of Long Beach. Item 26 is a communication from council members and has Council Member Rangel recommendation to increase appropriations in the city manager's department by 1000.'",
        "'speaker_1': 'To provide donations to Elmore City Heritage Association to support the 2021 Will Moore slam season of Live Arts and Music, Virtual Addition and item 32. Is a communication from Councilwoman Price recommendation to increase appropriation in the City Manager Department by 700 to provide a contribution to the Wilson Instrumental Music Booster Organization.'",
        "'speaker_0': 'Thank you. Can I get a motion in a second, please, on this? I have a most of my councilman allen is thinking about Councilmember Ringa. I don't believe we have met him for public comment for any of these.'",
        "'speaker_0': 'Is that right? We had no public comment. Okay. Great. Unless somebody wants to say any remarks from from from those. Councilman, our Councilman Allen do have any remarks.'",
        "'speaker_2': 'A Yes. Thank you, Mayor. I just want to real quickly and briefly, I just want to thank the man with 2/1 names, Director Brant Dennis, for his just for his partnership in this mobile basketball program. And, you know, these outdoor activities for kids are super important to me.'",
        "'speaker_2': 'And it brings me so much joy when I see the kids and the parents all at the one two year old beach, you know, shooting the hoops. And I go down there and I check that out over the weekends.'",
        "'speaker_2': 'And I love seeing just people waiting. Sitting on the ball are just waiting for a pickup game. And I love bringing my nephews down there. But one of the things that we were missing, there's just not enough of them.'",
        "'speaker_2': 'So I think that these hoops will be, you know, just real important for they you know, they can go on in and play with each other and just give them things to do. Plus, I want to say that the portable hips will be beneficial for years to come and it will add, you know, major flexibility to our'",
        "'speaker_2': 'recreation staff to deploy them around the the second district. So my staff did tour at different areas and the potential sites for these kids who will be possibly at Pierpoint Landing Promenade Square Park in Bixby Park. So just want to thank Brant enough and I can't wait to get this set up.'",
        "'speaker_2': 'And. And Brant, we're going to do a pickup game together. Thank you so much.'",
        "'speaker_3': 'That's right. I've been practicing, so I got to keep up with you. Good victory.'",
        "'speaker_0': 'Thank you. Customer Orangutan. Do you have any comments?'",
        "'speaker_4': 'No. I will defer to custodians and that.'",
        "'speaker_0': 'Consumers in the House.'",
        "'speaker_2': 'Thank you and thank you, Councilman. Councilmember Dunga, I just wanted to say thank you to the lovely flavor of Long Beach programs. I'm so excited about giving and supporting this, this or this program and this organization. This Saturday, we will be having a taco festival at our very own and wonderful, wonderful Scottish.'",
        "'speaker_2': 'Right. And so I want to I want to invite everybody. It's going to be from ten. I'm sorry. It's going to be from 12 to 6 at the Scottish Rite Event Center here in the First District. And I couldn't be more happy to partner with with flavors of Long Beach and Long Beach, home and living.'",
        "'speaker_2': 'And of course, rock sounds big shout out to Robert. And so come join us this Sunday, May 23rd, from 12 2 to 1. I also want to congratulate, well, more for their continued hard work in in giving to and and providing space for the arts.'",
        "'speaker_2': 'I think that the arts has.'",
        "'speaker_5': 'Been.'",
        "'speaker_2': 'Extremely, extremely impacted by COVID. And so I'm just incredibly grateful to be able to support this kind of event for our Willmore Neighborhood Association. Keep doing the great work that you're doing. So very, very thankful for that.'",
        "'speaker_0': 'Thank you. With that, we'll take a roll call. Vote for all items, please. 24, 25, 26, 32.'",
        "'speaker_1': 'Councilwoman Sandy has. I have a woman I own. I can't woman price. I have been all kinds of women. Mango. I can travel men. Sara.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Councilmember Oranga.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'Councilman Alston.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'Vice Mayor Richardson.'",
        "'speaker_3': 'Yes.'",
        "'speaker_1': 'Bush and Kerry.'",
        "'speaker_0': 'Thank you, madam. Cookies. I am 31. The item that we postponed from last week was at a different one. Well, let's hear 31.'"
    ],
    "Shoemaker Bridge Replacement Project: Cooperative Agreement, Contract Amendment and Appropriation Increase.": [
        "'speaker_1': '31 Adam 31 Report from Public Works. Recommendation to execute a second requirement for the California Department of Transportation for the design and construction phase of the Shoemaker Bridge Replacement Project, District one and two.'",
        "'speaker_0': 'Mr. Monica, do you have a report on this or is this different from the one that we postponed?'",
        "'speaker_6': 'The one that we postponed had to do with the entitlement process. This is a word of funding from Caltrans to proceed with the project once it's entitled.'",
        "'speaker_0': 'Right. Can I get a motion in a second place? Give a motion by councilors and they have the customary ranga. Do I have a public comment? I might add. So they do on this list?'",
        "'speaker_3': 'Yes, we do. Alex. Please begin. Alex, turn. Please begin.'",
        "'speaker_0': 'Alex. These are either. Okay. We're going to go we're going to go ahead and go to a vote of the council. Please.'",
        "'speaker_5': 'Call.'",
        "'speaker_1': 'Councilwoman said they have. Councilwoman Allen.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Councilman Price. Mr. Mayor, can we have the motion and the movement and seconder.'",
        "'speaker_0': 'Sure is in Dallas and Durango.'",
        "'speaker_1': 'Okay. Thank you. As women said they have. I just want to know when. I mean price. I recommend Sabina.'",
        "'speaker_3': 'And.'",
        "'speaker_1': 'Councilwoman Manga. I has a woman, Sarah. I'm Councilmember Oranga.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'Councilman Austin.'",
        "'speaker_4': 'All right.'"
    ],
    "Restoration of Budget Adjustments due to Furlough Elimination. ": [
        "'speaker_1': 'Vice Mayor Richardson. Yes. Well, she carries.'",
        "'speaker_0': 'Item 36.'",
        "'speaker_1': 'Adam, 36, is a report from Financial Management. Recommendation to approve the restoration of departmental and fund budget appropriation. Adjustment related to the elimination of employee furloughs for the remainder of fiscal year 2021 through.'",
        "'speaker_0': 'I can I get a motion in a second please? Mr. Monica, do you want to add anything?'",
        "'speaker_6': 'Nothing to add on this one.'",
        "'speaker_0': 'Okay. There's a motion to say. Councilman Allen seconded Councilmember Ringo. Members, please go ahead and do a roll call vote.'",
        "'speaker_1': 'And one minute, Cindy has arrived. Councilwoman Allen. I can't remember. I can't subpoena Councilwoman Munger.'",
        "'speaker_5': 'Yes.'",
        "'speaker_1': 'Councilwoman Sara.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Also member Virunga.'",
        "'speaker_4': 'All right, Councilman Austin?'",
        "'speaker_1': 'Yes, Vice Mayor Richardson.'"
    ],
    "Presentation from Safe Spaces Alliance on LGBTQ+ Safe Spaces in Long Beach.": [
        "'speaker_3': 'Yes.'",
        "'speaker_1': 'Motion. Kerry.'",
        "'speaker_0': 'Adam, 27, please.'",
        "'speaker_1': 'Item 27 is report is communications from councilwoman Sunday has Councilwoman Allen, Councilwoman Price and Councilmember Oranga recommendation to receive and file a presentation from Safe Spaces Alliance's.'",
        "'speaker_0': 'Councilman in Dallas.'",
        "'speaker_2': 'Thank you, Mayor. And happy pride, everyone. I just wanted to say that I know that me is Pride Month here in Long Beach, and unfortunately we are celebrating it differently this year, but it's still something very important to celebrate.'",
        "'speaker_2': 'I think then it's just super important to be able to celebrate it, especially during these times. One of the things that I'm super excited to do is to partner up with Safe Spaces Alliance, and I'm just going to give them the rest of my time to do a brief presentation on something that I'm very, very proud to'",
        "'speaker_2': 'support. Think you. Thank you, Councilwoman Zendejas and everyone, we just wanted to share with you a little bit about our Safe Spaces alliance. After the Rainbow Tower burned, we wanted to reassure our LGBTQ plus community and visitors that they're safe and they're welcome here.'",
        "'speaker_2': 'So we created the Safe Spaces Alliance. We reached out to the Long Beach, LGBTQ plus Chamber of Commerce and also the LGBTQ center, Long Beach, for their support, as well as Councilwoman Sun House. And we launched our video campaign about two weeks ago, and we've gotten a really amazing positive response.'",
        "'speaker_2': 'Over 45 businesses have already taken the pledge. And we have a short video, just a compilation that we'd like to show.'",
        "'speaker_3': 'Hi. My name is Carla Stories and I am the director of the LGBTQ Center in Long Beach for us here at the LGBTQ center, what's important is to become part of the Safe Space Alliance and really embody the You Are Welcome Here initiative because it is important for members of our communities young and.'",
        "'speaker_2': 'Not in.'",
        "'speaker_3': 'Thinking that we are part of the fabric of Long Beach, where everywhere and we need to feel safe being ourselves in a variety of.'",
        "'speaker_1': 'Different numbers. The video is playing at home, but.'",
        "'speaker_3': 'The center will be working with employers to help provide tools on how they can become more affirming and welcoming, or don't see it on the online screen as employee masks as well as serving the community at large. So anyone who's interested, stay tuned because more information is coming.'",
        "'speaker_3': 'You're welcome here.'",
        "'speaker_8': 'Ira MGM.'",
        "'speaker_2': 'And I.'",
        "'speaker_8': 'Patrick Vieira on what is a specialty coffee shop, the Cafe Natural Organic Wine Bakery here in Long Beach. We are really, really clear and we just want to let everybody know that you are welcome here.'",
        "'speaker_3': 'Hello. My name is genuinely I'm the owner of Fluffy Snowballs. We are the first specialty quick service restaurant in Long Beach that sells authentic.'",
        "'speaker_4': 'New Orleans snowballs. I am a member of the LGBTQ idea and I want you to know that you are welcome.'",
        "'speaker_9': 'You are welcome.'",
        "'speaker_4': 'Here.'",
        "'speaker_3': 'Lovely snowballs.'",
        "'speaker_9': 'Man trying to find one of the owners here or the horseman or sitting in the dark area, which is dark reality that. Behind us right before. Do we, our friends or allies?'",
        "'speaker_8': 'We are employers.'",
        "'speaker_9': 'Who want everyone to know Iraq.'",
        "'speaker_8': 'Everybody. It's a stubborn president. Long Beach, LGBTQ plus Chamber of Commerce. You provide education. To show you how you can win big business with big corporations. We provide networking and promotion to make sure you get the visibility you need.'",
        "'speaker_8': 'We provide advocacy and inclusivity. We advocate for you and we try to include all of us and the friendship and community. This is a small community and we like to lift each other up. Here in Long Beach, we think it's important to make sure that you feel comfortable in your own city.'",
        "'speaker_8': 'And we want to make sure that, you know, you are welcome here. Hey, everybody, at Jones and Hamburger Mary's. And we want you.'",
        "'speaker_4': 'To know that you are welcome.'",
        "'speaker_8': 'Here in the LBC. We love you, baby.'",
        "'speaker_1': 'That's when the video is over.'",
        "'speaker_2': 'Thank you. Thank you very.'",
        "'speaker_1': 'Much for.'",
        "'speaker_2': 'That video. I think that was such a beautiful video. Great job. I'm so excited. It just warms my heart. But would you do you have any closing remarks? Oh, well, we just wanted to say that the reason why we did this, because we do want people to feel comfortable in Long Beach and physically.'",
        "'speaker_2': 'Long Beach is a nonprofit organization. And what we do is we want people when they come here, to feel comfortable, especially their LGBTQ visitors. We want them to have inclusive, safe experiences here. And we will we do we we do fundraising so that we can give back to our community.'",
        "'speaker_2': 'So we're hoping to get the city's support to make this a citywide initiative. Thank you. Thank you so much, both of you. I'm super excited about this. And I can't wait to see these flags just plastered throughout our city.'",
        "'speaker_2': 'And and just for us to really, really send a clear message out there that you are welcome here in Long Beach.'",
        "'speaker_0': 'Things got repriced.'",
        "'speaker_2': 'Thank you, Mr. Mayor. I wanted to echo the comments of Councilman Zane de Haas. Thank you for allowing me to sign on to this item. I really wish we had the this is actually the second year that we're having to really change the way we celebrate pride and change the activities of the city.'",
        "'speaker_2': 'And if you would have asked me last year, I would have never thought it would be two years. So I'm really grateful for everything that you guys are doing to keep just inclusive inclusivity and diversity and acceptance and love at the forefront of all of our minds.'",
        "'speaker_2': 'And thank you, Councilwoman Zendejas, for bringing this item forth.'",
        "'speaker_0': 'Thank you, Councilman Alamo.'",
        "'speaker_2': 'Yes. Thank you, Mayor. I absolutely love this item. And and thank you, Councilwoman Sun Hoss, for highlighting just the great work safe spaces. I know that the burning of our pride tower was just shocking and painful, and our community is still recovering from that.'",
        "'speaker_2': 'Just know that you're, you know, as one of your elected council women that I will do everything that I possibly can to uplift the LGBT community and just send a clear message of inclusion. And I think together, all of us, that we will create this welcoming and inviting space for all of our communities.'",
        "'speaker_2': 'And I do believe that the Safe Spaces DeKalb campaign is one of the ways that we can just tell everyone that they are welcome here in Long Beach. So I just want to recognize you and applaud you and thank you for all of your hard work.'",
        "'speaker_2': 'And I look forward to seeing these decals all over the city on every door. So thank you.'",
        "'speaker_5': 'That's 72.'",
        "'speaker_0': 'Thank you, Councilmember Ringo.'",
        "'speaker_4': 'Thank you, Mayor, and thank you, councilmember senators, for bringing this forward. Thank you for inviting me joining us, because I always have fun this time of year. I'll be praying.'",
        "'speaker_0': 'Last May, Richardson.'",
        "'speaker_3': 'Thanks, Mr. Mayor. Thanks. Thanks, Mary, for bringing this forward. Happy pride, everyone. I just have a simple question. Where can I get Medicare?'",
        "'speaker_2': 'I'll take the pledge and I'll send you on the Safe Spaces Alliance dot com.'",
        "'speaker_3': 'Fantastic. Thank you so much.'",
        "'speaker_0': 'Thank you, Madam Cook. Is there any additional public comment?'",
        "'speaker_1': 'There's no additional cover coming.'",
        "'speaker_0': 'Consumers and they have. I'm sorry, were you cued up again? I do.'",
        "'speaker_2': 'I just wanted to see if we could share where where we can get our decals. But that was just said, too. But if you could please repeat it one more time so that everyone that's watching us or listening to us knows where they can get their data.'",
        "'speaker_2': 'Please. Sure. Sure. We have a website. It's Safe Spaces Alliance dot com. So if you take the pledge and you put in your mailing address, we will Melbourne to you. Amazing. Thank you. Thank you very much. And as you know, Pride and the Pride Parade is one of my favorite events in in the city all year long'",
        "'speaker_2': '. I really look forward to it. But one of my biggest goals during war that I had when I became councilwoman is not only to attend the Pride Parade, but to actually beat out Councilwoman Price because she always has a party at her clothes, you know?'",
        "'speaker_2': 'So I wanted to make it a competition, but we weren't able to do it last year. We weren't able to do it this year. But next year I look forward to bringing back all of our festivities during Pride Month and that gives us something to look forward to and a lot of time to make sure that we'",
        "'speaker_2': 'compete with Councilmember Price. So thank you. Thank you so much for this wonderful presentation and thank you, everybody, for supporting this. Thank you for your time. Thank you.'",
        "'speaker_0': 'Thank you very much and thank you both for a really great presentation and amazing program and happy to talk to both of you. But happy pride to everyone as well. And obviously these kind of projects are really what language is all about.'",
        "'speaker_0': 'So just thank you very much for joining us tonight. We appreciate.'",
        "'speaker_2': 'It. Thank you, Mary.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'With that metal circle. Couldn't do the roll call.'",
        "'speaker_1': 'As we mentioned, they have. I'm Councilwoman Allen. I'm Councilwoman.'",
        "'speaker_2': 'Pryce, I.'",
        "'speaker_1': 'Councilman Spinner.'",
        "'speaker_3': 'Right.'",
        "'speaker_1': 'Plus a woman. Mango?'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Kind of woman. Sara. I council member.'",
        "'speaker_4': 'Oranga i.'",
        "'speaker_1': 'Councilmen Austin.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Vice Mayor Richardson.'",
        "'speaker_3': 'Yes.'",
        "'speaker_1': 'Person case.'"
    ],
    "Feasibility of Open Space Park and Walking Path along San Gabriel River.": [
        "'speaker_0': 'Thank you very much. Next item will be item 28.'",
        "'speaker_1': 'Item 28. Communication from Councilwoman Price. Councilwoman Mango. Recommendation to request City Manager to consider the feasibility of developing an open space public park area and walking path along the San Gabriel River.'",
        "'speaker_0': 'Thank you. Turn this over to Councilwoman. Among our custom on price. Well.'",
        "'speaker_2': 'Thank you, Mr. Mayor. I'll go first and I'll turn it over to Councilor Mungo. So I want to thank my the people who cosigned on to this item. Councilman Mungo, I know she's going to have some words to share about this item.'",
        "'speaker_2': 'And I want to thank Assemblymember O'Donnell, because he has really been working with the Rivers and Mountains Conservancy and trying to identify ways that we can activate this public space through the use of possibly some city of some state dollars, not city dollars.'",
        "'speaker_2': 'And this is an area that borders three different districts. And right now there is a bike path for the major portion of the river. And the bike path is is the place that welcomes a lot of experienced riders.'",
        "'speaker_2': 'They often travel in large groups and they often travel fast, which is great, but it's not the ideal setting for a walking path. And so I'm hoping that with the support of the Council tonight, our city staff will be able to work collaboratively to enhance this public space and create some pedestrian access at the very least, and'",
        "'speaker_2': 'do so utilizing non city dollars through a partnership with the county and through support and some hopefully some resources from the state. So I would like to request our staff work on finding ways to identify what is feasible.'",
        "'speaker_2': 'What kind of community outreach might be required once funding is identified to make sure that the concerns of residents and also the interests of residents are captured in whatever project could come from outside funding to help with this particular vision.'",
        "'speaker_2': 'So with that, I'd ask for my council colleagues support. I do want to highlight a couple of things. This is public land that we're talking about, and it is not. There is no proposal whatsoever to use any city dollars to support this project down the road.'",
        "'speaker_2': 'It's just an ask for the city to work with the county and the state in identifying resources that I believe Assemblymember O'Donnell is already working on, not just for this particular area, but throughout his Assembly district. So thank you.'",
        "'speaker_2': 'Thank you. Thank you, Councilwoman. Thank you, Mayor. The area in question has been of significant debate on the east side for many years. I've hosted meetings at the apex of the three districts, and through the years we've had significant challenges in that.'",
        "'speaker_2': 'The area in each of our districts is very different. But it is a contiguous strip that has three different government agencies as landowners. Each of those government agencies has been open to leasing back that land, potentially as low as a dollar a year.'",
        "'speaker_2': 'But there has to be a plan and there has to be a plan based on what's possible. And we need to work together to figure out what that is and then reach out for the community input. Councilman Price continues to highlight that this would not cost city resources.'",
        "'speaker_2': 'It actually would be a city resource saver. Considerable resources continue to be necessary to modify and clean up the areas adjacent to these lands. These properties because of inappropriate uses. And so activation of this space has been something that the residents in my district have been requesting, but only within the last 90 days has the property become'",
        "'speaker_2': 'vacant because a tenant defaulted in a major way, not financially, but through multiple violations. So we are excited for this opportunity. It's something we've wanted for a long time. We've worked with the Economic Development Department for years on what would even be possible.'",
        "'speaker_2': 'We've worked with the City of Los Angeles, who it surprises people often that the city of Los Angeles is a landowner in the fifth District, so as a water district and the county of Los Angeles. So it is complicated.'",
        "'speaker_2': 'But when we have leadership from our state representative, Assemblymember O'Donnell, to really bring all the pieces together, and I will say, I also appreciate Senator Gonzalez, who has been a part of some of our community meetings on our side of town to discuss these issues.'",
        "'speaker_2': 'It really makes all the difference. And so with the opportunity of some of the additional funding that Governor Newsom has available and the championing of Assemblymember O'Donnell, this could really become a reality. And we need to be prepared for what that is.'",
        "'speaker_2': 'And we need to quickly put together feasibility of what's possible and then from there really identify what the community is interested in and how that could better support the city budget so that resources don't continue to have to be spent in cleaning up an area.'",
        "'speaker_2': 'Once we activate it, we believe it will keep itself clean. Thank you.'",
        "'speaker_0': 'Councilmember Durango.'",
        "'speaker_4': 'Thank you, Baron. I'm glad to hear that. So projects are taking place at the San Diego River, and we are, as you probably know, we have some projects that are being developed in the Lower Los Angeles River that also crosses three districts that are in development.'",
        "'speaker_4': 'And hopefully within a very short time, I can bring forward a presentation as to what's going on around the L.A. River. We also we think there's a lot of work to be done, and I'm hoping that I, too, can work with a similar our on council and Senator Gonzalez to bring much needed resources into that area as'",
        "'speaker_4': 'well. So thank you for bringing the focus on this onto the Tangi River as well. Thank.'",
        "'speaker_0': 'Thank you. Cats are a super supernova.'",
        "'speaker_3': 'Thank you. As was mentioned, this involves three districts. The fourth council district has a two mile border along the San Gabriel River. Unfortunately, I was not given a heads up on this item. I didn't learn about it until it appeared on the agenda eight days ago, so I didn't have the opportunity for public outreach.'",
        "'speaker_3': 'But that being said, we have a great deal of public input on this area at the southern end of the two mile stretch and five years of complaints of encampments and whatnot that are virtually impossible to address. So for that reason, unfortunately, I will not be supporting the item tonight.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Council member, Austin.'",
        "'speaker_4': 'Well, I think any time we have an opportunity to to develop longer are open spaces along our our rivers of law L.A. River, San Gabriel River. I think it's it's an opportunity we need to to explore. We need to look at in and if there is funding for, we definitely need to have a plan in place and'",
        "'speaker_4': 'champion. And so I commend Councilmember Price and Mongo for bringing this forward more. We cannot get enough of open space, green space that is actually programed in and for active use, even passive use in our city. And so I support this and I think this is also an opportunity for some of the the advocacy groups around river'",
        "'speaker_4': 'projects to to to jump on board with the projects on both sides of the city, east side and west side. Because I want to just say, I heard a lot a lot from people on the east side of the city regarding the projects going on.'",
        "'speaker_4': 'On my end of town, I think we're still one city and any opportunity we can get to expand open space is a good thing. So I support.'",
        "'speaker_0': 'Councilwoman Sara.'",
        "'speaker_2': 'Thank you, Mayor. I also just in general support turning any open land that's public to low impact recreational space. And I think that it's also in alignment with the state's effort to conserving 30% of our as well as federal goals to conserving 30% of our U.S. land and ocean by 2030.'",
        "'speaker_2': 'So I think this is just contributing to it. So I so that's kind of. What I think is. Yes, I support the item. Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman Mongo.'",
        "'speaker_2': 'Thank you. I appreciate councilmember super nice comments. And I will say that I should have reached out and extended a hand. I will say, though, that when my encampment meeting started about five years ago, I was surprised. I had recently been elected and when I asked the community members that were not from my district who were on'",
        "'speaker_2': 'the other side of the street, if they spoke with their councilmember and this predates you, they said, no, we're represented by Councilman Price. Actually, when I was elected, didn't realize that our two districts touched, but they do in a certain area.'",
        "'speaker_2': 'And when I was touring the facility three weeks ago with L.A., DWP and community members, only community members from my district were there and DWP identified specifically the third district in mind. So I did not realize what part of that that is.'",
        "'speaker_2': 'And that was just an oversight or misinformation by L.A. DWP. No slight intended, but I appreciate your perspective. And of course, my community has also stated that they feel as though there's been no community outreach before this item was brought forward, but nothing could be further from the truth.'",
        "'speaker_2': 'Literally, the very first meeting since I was elected in 2014 included discussions of challenges with this area in our district. And so while the specific item in the way it is written today was not featured, it has been a topic of dozens of community meetings over the years, including our homeless meeting, our encampment meetings, our jerk cross'",
        "'speaker_2': 'jurisdictional meetings and the such. And I know that I recently reached out to a couple of or my chief has reached out to a couple of other chiefs of staff related to our upcoming homeless meeting where I know this will again pop up and of course anyone is invited as long as we don't have too many members'",
        "'speaker_2': 'to break Brown Act. Thank you.'",
        "'speaker_0': 'Thank you. I don't think there's any public comment on this. Correct. So we'll go ahead and go to a roll call vote.'",
        "'speaker_1': 'Councilwoman Sun has. I'm Catwoman, Ellen.'",
        "'speaker_2': 'Right.'",
        "'speaker_1': 'Councilwoman Price. I can swim and super now.'",
        "'speaker_3': 'They.'",
        "'speaker_1': 'Can swim and mango.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Councilwoman Sara I. Councilmember Aranda. I know.'",
        "'speaker_4': 'All right.'",
        "'speaker_1': 'Vice Mayor Richardson.'",
        "'speaker_3': 'All right.'"
    ],
    "Application for Affordable Housing and Sustainable Communities Program Funds for Union Project.": [
        "'speaker_1': 'First, John Kerry.'",
        "'speaker_0': 'Thank you. Next up is item 29, please.'",
        "'speaker_1': 'Item 29 to report from Development Services. Recommendation two Adobe resolution authorizing the submission of an application for up to 30 million in loan and grant funds and authorize City Manager to utilize these funds for the construction of the Union Affordable Housing Project proposed for the development at 1401 Long Beach Boulevard, District one.'",
        "'speaker_0': 'Think. Can I get a motion in a second, please? Can I get a second? Casey. No public comment. Roll call vote.'",
        "'speaker_1': 'Mr. Mayor, can I have the move in a second, please?'",
        "'speaker_0': 'Sir, I was in the house. And your anger.'",
        "'speaker_1': 'Trans woman Sunday has.'",
        "'speaker_5': 'High.'",
        "'speaker_1': 'Times. WOMAN Alan. I found a woman price. I compliment it, but I. I Catwoman Mangum?'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Councilwoman Sarah.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Council member Oranga.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'Councilman Austin.'",
        "'speaker_4': 'Hi.'",
        "'speaker_1': 'Vice Mayor Richardson?'"
    ],
    "Moratorium and Market Study for West Long Beach Transportation Corridors.": [
        "'speaker_1': 'Vernon Kay.'",
        "'speaker_0': 'Thank you. Next up with item 33, please.'",
        "'speaker_1': 'Item 33 is communication from council member Virunga Councilwoman Sunday has Councilwoman Ellen and Councilman Alston recommendation to request city attorney to drop an urgency ordinance establishing a moratorium on the issuance of building or construction permits for the construction of new standalone residential structures along transportation corridors in West Long Beach to ensure land use element zoning change changes'",
        "'speaker_1': 'occur prior to issuing building or construction permit and requires city manager to develop a plan and identify funding to conduct a market study to attract investment and neighborhood serving users.'",
        "'speaker_0': 'Sorry, Ringo.'",
        "'speaker_4': 'Thank you, Mary. And I want to thank council members and Allen and Austin for joining me in sponsoring Recital Weston, which is a working class neighborhood bounded by the port of all Mich on the south Wilmington refineries on the west, the four or five freeway to the north and the 710 freeway and the Los Angeles River to'",
        "'speaker_4': 'the east. The proximity to industry and major freeways have resulted in pollution and historic disinvestment in the area. Today, West Long Beach does not have a single full service grocery store, bank or pharmacy. For these needs, residents of West Palm Beach must drive over the river to spend their money in other neighborhoods.'",
        "'speaker_4': 'This is not just an inconvenience. This is a lack of service and slow economic growth in the area. It would be devastating if a natural disaster were to render the L.A. River impassable. To address this land use element.'",
        "'speaker_4': 'To address this, the land use element adopted by the City Council in 2019 2019 designated the corridors of Santa Fe Avenue between Pacific Coast Highway and Wardlow and will a street between the 710 Freeway and the term and the city terminus as neighborhood serving centers.'",
        "'speaker_4': 'This designation is designed to make consumers daily needs for goods and services close to residential areas. Ideally, residents could walk to these locations where shopping, banking, personal services or dining. Unfortunately, current zoning practices allow for development that does not serve as designation as those progress toward attracting important neighborhoods or serving businesses such as grocery stores, pharmacies, banks'",
        "'speaker_4': 'or cafes. In the city clerk put up. Those are pictures I sent earlier. This is the corner of Santa Fe and Hill and West Long Beach. This is a before picture. You notice there's a commercial building to the left and a parking lot in that area.'",
        "'speaker_4': 'Behind that is a soccer field and rocket park. You could bring up the next picture, please. City clerk. The next picture. And this picture. Now, you see that same parking lot converted into a single family residence. And you still see the commercial building right next door.'",
        "'speaker_4': 'So not only does it block the view to the park, it just totally transform that corner into a residential house with no parking whatsoever unless you go to the park area. This is a type of development that disenfranchizes the community and just limits the economic growth of the area.'",
        "'speaker_4': 'This item will pause the issuance of permits for new residential developments at Santa Fe and will and will allow time for the city to update its zoning practices to better comply with the land use element. Additionally, the city manager the city manager Will is being tasked to conduct a market study with the goal of attracting major neighborhoods'",
        "'speaker_4': ', serving businesses into that area. Thank you for joining me again in supporting this item. And it is important for the investment of our West Palm Beach area neighborhoods. And I and I ask for your yes vote on this.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you. Can I get. I have a second. But, Councilman Allen. He's seeing any anything no other from comment or account members will cover.'",
        "'speaker_1': 'Compliments of the house.'",
        "'speaker_2': 'Is that I think Councilmember Allen was trying to say something. Yes. I just wanted to say something very quickly.'",
        "'speaker_5': 'Absolutely. Councilman Allen.'",
        "'speaker_2': 'Okay. Yes. I just want to say, first of all, just to say thank you, Councilmember you're Ranga, for bringing this forward. I just support this item. We need our development projects to be aligned with our land use element.'",
        "'speaker_2': 'You know, I grew up on the West Side at Baltic and Spring, and as Councilman Turanga said, projects in the West Side should follow the land use element and complement neighborhoods and mixed use services. I definitely think the housing is important, but we also need to focus on building up the area.'",
        "'speaker_2': 'And for God's sake, they need a they need a grocery store. So I guess I look forward to hearing back on strategies that can that can attract businesses and investments. Thank you.'",
        "'speaker_0': 'Thank you. Thank you. Roll call. Vote, please.'",
        "'speaker_1': 'Councilwoman Sun has. I am the woman. Ellen.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Councilwoman Pryce.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Councilman Sabrina.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Councilwoman Mongeau.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Councilwoman Sara.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Councilmember Suranga.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'Councilman Austin.'",
        "'speaker_4': 'Right.'",
        "'speaker_1': 'Vice Mayor Richardson.'",
        "'speaker_3': 'Yes.'",
        "'speaker_1': 'Version K.'"
    ],
    "SCAG Year in Review Presentation and Report.": [
        "'speaker_0': 'Thank you. I think our last item is item 35.'",
        "'speaker_1': 'Item 35 Communication from Vice Mayor Richardson. Councilwoman Cindy has Councilman Allen Councilwoman Zahra recommendation to receive and file presentation and report from SCAD year in review highlighting the President's 2020 make through 2021 work plan.'",
        "'speaker_0': 'Of Richardson.'",
        "'speaker_3': 'Thank you, Mr. Mayor. As one of the just concluded my year as president of SCAD. I want to thank my colleagues for allowing me the time since 2014 be a part of this board, the great regional board. I've learned a lot and I've become a better leader as a result of the experiences being there.'",
        "'speaker_3': 'And, you know, traditionally when you serve on a board or you go to a study tour, you come back and report back to city council. So I'm happy to attach my year review report and I have a video just to show this.'",
        "'speaker_3': 'This year has been a you know, it's been a hard year. You know, I've been in the past, I've been able to go study alternative forms of transportation in Australia or, you know, the challenges around clean air in China.'",
        "'speaker_3': 'And, you know, we got you know, we got invited to Israel and Hawaii and all those things. This wasn't the year for that. This year was really local government folks hunkering down and getting work done. And so I want to thank Councilmember Allen.'",
        "'speaker_3': 'Also, Councilman Austin serves on the committee for being good members of of for being good members of SAG. And I want to take a moment to show the video of the year in review video. Thank you. When I think back of the events of the past year, I go back to the moment that we learned that COVID'",
        "'speaker_3': '19 was here in our communities and that we needed to respond.'",
        "'speaker_8': 'It's a strange world, the space between things.'",
        "'speaker_3': 'What we learned was that essential workers still need to go out and provide basic services. And we learned that schools may be closing and that if you weren't essential worker, you may not have had the means to provide for your family.'",
        "'speaker_3': 'So it was a very scary time.'",
        "'speaker_8': 'Now I know that when we get out of this, I.'",
        "'speaker_4': 'Want to help.'",
        "'speaker_8': 'When we will.'",
        "'speaker_3': 'But during that time, local government still needed to provide its basic needs and basic services. And so local leaders needed to step up and find a pathway forward without a lot of certainty about what the future looks like.'",
        "'speaker_3': 'I think about the Southern California region. We're already a region with tremendous opportunity, but also great meaning. We were in the midst of a housing crisis, a regional housing needs assessment. Next, local plan, setting our goals and vision for the next 25 years.'",
        "'speaker_3': 'And that work couldn't stop. So this regional council of local leaders from six counties continue to work through the challenges to make sure that we're setting the stage for a Southern California that's inclusive and strong.'",
        "'speaker_5': 'And think, get this.'",
        "'speaker_3': 'Ordinarily, our year is busy at SCAD because we have a lot of things that we get involved with as a regional MPO. But to have the combination of two primary assignments that SKOG has, one that's done every four years, and one that's done over eight years, to have those two come together in one year, obviously was a'",
        "'speaker_3': 'lot of work to get done. Where we had the most significant impact is not what we were able to do, but how we were able to do it. We had every excuse in the world to not meet our deadline on Connect somehow or not adopt the methodology on Rina or to not address the economic recovery.'",
        "'speaker_3': 'But we did it all, and we did it all in a fashion that built a real consensus across the region and helped place our region on a stronger, more firm footing for the future. A lot of decisions have been made in the last year and a half that have been very difficult, that have required a lot of'",
        "'speaker_3': 'regional thinking as opposed to parochial thinking. And I think that's where you have to celebrate our regional leaders, our board members that have come from these various cities and counties able to come together and actually fight for what is in the best interest of the region.'",
        "'speaker_10': 'This last year was a little harder for Skaggs than other years because we had to work on the RTP or Connect SoCal as well as regional housing needs assessment. You know, this plan is almost a half trillion dollar plan, planning out the regional transportation needs for the next 20 years.'",
        "'speaker_10': 'This is really important that we do advanced planning so that local entities such as my city of Ontario and the County of San Bernardino can aim all of its projects to what would be beneficial for the entire region.'",
        "'speaker_2': 'This year, we developed and adopted a final allocation plan for the six cycle regional housing needs assessment, which will help cities meet anticipated things in the six county region over much of the next decade. In the process, we gather input from throughout the region, examined a variety of methodology options and in the end challenge ourselves to come'",
        "'speaker_2': 'up with a formula that addresses our housing needs in an effective and equitable manner. And now PSAC is focused on providing communities with the technical support it needs to meet that challenge.'",
        "'speaker_8': 'During this past difficult year, Scaggs staff, it's really stepped up to develop tools that we can all use in our cities and counties to deal with complex data that we need to make better plans and figure out how we're going to get to where we want to go, including the regional data platform.'",
        "'speaker_8': 'The housing element parcel especially directs us to solutions for our housing challenges. Additionally, we have COVID Vulnerability Indicators Dashboard again helping us figure out how COVID has affected our communities, which particular segments are really having challenges, and what we can do when.'",
        "'speaker_8': 'We learn where those challenges are. So with this technical assistance that our brilliant staff has come up with, we can work better for a better future for all of us with our different challenges. Last July, SAG declared racism as a public health crisis and in the months since has led region wide discussions on ways to eliminate barriers'",
        "'speaker_8': 'that reduce opportunity for millions of Southern Californians. The results of this effort include a draft framework for the agency's action plan on racial equity and the development of an inclusive regional economic recovery strategy for Southern California to make a true recovery from the devastation of this public health and economic pandemic.'",
        "'speaker_8': 'We need to close this historically large racial equity gap and factor in the importance of long range planning for transportation and land use in creating more inclusive communities.'",
        "'speaker_10': 'Research is always a big part of what's kept us. But this year, COVID changed our lives in ways we could not imagine. As a result, many of our studies took on a new sense of urgency. Some of these studies included an early preview of the economic impacts of COVID on the region, a last mile freight study addressing'",
        "'speaker_10': 'the very real surge in both business and home deliveries, and analysis of changing transportation demands, and a sophisticated economic forecast that illuminates the need for an inclusive economic recovery strategy.'",
        "'speaker_3': 'One of the biggest.'",
        "'speaker_4': 'Successes this year has been in the support we've been able to give at the local, city and county level.'",
        "'speaker_3': 'Millions of dollars in funding are being invested across many different areas of land use and transportation planning.'",
        "'speaker_4': 'Some of these include a series of local technical assistance programs that will invest.'",
        "'speaker_3': 'Nearly $65 million in local plans and programs. A subregional partnership program allocating $23 million to local governments to prepare and implement local housing elements. The Sustainable Communities Program, which is supporting projects in the areas of active transportation and safety.'",
        "'speaker_4': 'Housing and sustainable development and smart cities and mobility innovations. We also.'",
        "'speaker_3': 'Have the 28 mini grants awarded through the Go.'",
        "'speaker_4': 'Human Campaign to Fuel Community.'",
        "'speaker_3': 'Active Transportation Safety and Engagement Initiatives. We have multiple programs geared towards.'",
        "'speaker_4': 'Accelerating urgently needed housing production throughout the region. All of this local level support is emblematic of the collaboration and partnership that is so central to who SAG is a win for our cities, a win for our counties. That's a win for Skegg.'",
        "'speaker_3': 'It's a win for the Southern California region, and that's what we're here to do. The COVID year, as I call it, the year 2020 taught us a lot of things and we did a lot of things that we had not done before.'",
        "'speaker_3': 'And so it's been a very instructive year for us to on one level, to find that we have capacities that we didn't even know we had. But I just want to be very grateful for all of our stakeholders hanging with us, being with us through the changes in our processes and approaches to our work, all of them'",
        "'speaker_3': ', I think we're able to adjust to the new beat that we sort of began to dance to. It's Greg. Skog has the opportunity to help shape the future for Southern California, and the future is uncertain. When I think about the future, I think about my daughters, my six year old and my three year old, and the future'",
        "'speaker_3': 'that they will have growing up here in Southern California. I want them to have clean air to breathe. I want them to have clean water to drink. I want them to have access to affordable housing and jobs, education, economic opportunity.'",
        "'speaker_3': 'And we want this for all of our children. These are things that we all agree on. And as long as we continue to focus where our interests intersect, the future of Southern California will be bright. You do? So thank you.'",
        "'speaker_3': 'That concludes my presentation. It's been a it's been a great year. I plan to conclude my year is immediate past president and hopefully recruit one of my colleagues who wants to, you know, have the experiences that I've had.'",
        "'speaker_3': 'And it's going. So thank you so much for this opportunity to share this report. And it is attached. Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman Sarah.'",
        "'speaker_2': 'Thank you, Mayor. I want to congratulate Vice Mayor Richardson. Ah, former president of SAG Richardson, on a job well done and representing our great city at that level and said thank you so much for your service and your leadership.'",
        "'speaker_0': 'Councilman's in the house.'",
        "'speaker_2': 'Yes. I also want to.'",
        "'speaker_1': 'Congratulate.'",
        "'speaker_2': 'You, vice mayor, for a great job in representing the city of Long Beach. I know that you have been a great value just scad for for several years now. So I'm really excited for you and the experience that you've had and and also the leadership that you will continue to bring to us because of your experience there'",
        "'speaker_2': '. So, again, congratulations.'",
        "'speaker_0': 'Thank you, Councilman Allen.'",
        "'speaker_2': 'Yes. I think that was a great video and I just can't pass up on the opportunity to say thank you to our vice mayor for his service to Scott. That was an awesome video. Mr. Vice Mayor, you are absolutely the right leader at the right time.'",
        "'speaker_2': 'And you have led the charge on racial equality and inclusion as a gag as well as our city. And I know this to be a fact. Our our communities are going to benefit from your leadership for generations to come.'",
        "'speaker_2': 'I'm going to say this again. You are you are bold, you are fun, and you are hella passionate. And I applaud your work at SCAD. You are just an incredible chair. I learned so much from you. So just great work.'",
        "'speaker_0': 'Thinking, Counselor. Anger.'",
        "'speaker_4': 'In short, thank you for your service, Benjamin.'",
        "'speaker_0': 'Thank you. So what's gag again? I'm just kidding. Oh, I'm just joking. Well, no, listen, I'm just giving the vice mayor a hard time, so if you like, I like to do that. So congratulations, Rex, on your year of service.'",
        "'speaker_0': 'And I think I think, Councilman Allen, I think you serve on Skaggs also or the alternate. And we've had a long tradition of this body being involved on on Skye and at the Gateway COG and so many of these regional boards, which are always very important for the city.'",
        "'speaker_0': 'So congratulations. And with that, I don't believe there's any public comment. So we'll do a roll call vote.'",
        "'speaker_1': 'Councilwoman Sundance.'",
        "'speaker_5': 'Right.'",
        "'speaker_1': 'Councilwoman Allen. I'm Councilwoman Pryce. I can swim in super. I'm Councilwoman Mango.'",
        "'speaker_5': 'I.'",
        "'speaker_1': 'Councilwoman Sara.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Council member oranga.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'Councilman Austin.'",
        "'speaker_4': 'All right.'",
        "'speaker_1': 'Vice Mayor Richardson.'",
        "'speaker_3': 'Yes.'",
        "'speaker_1': 'Washington.'",
        "'speaker_0': 'Thank you. And with that, we have a new business, as we called Mayor Carlos, the man before we close. All right, Mr. City, Attorney, you have a ruling.'",
        "'speaker_6': 'Thank you, Mayor. This evening, in closed session, council authorized the settlement of the Anthony Garcia versus city of Long Beach litigation in the amount of $250,000 by a vote of 9 to 0. Thank you.'",
        "'speaker_0': 'Thank you. With that we're going to go ahead and ahead this. Sorry. Sorry, Charlie. Any business?'"
    ]
}