{
    "Name Change for the Seattle Commission for People with Disabilities.": [
        "'speaker_0': 'The Report of the Committee Economic Development Committee Agenda Item to Constable 119982 relating to the Seattle Commission for People.'",
        "'speaker_1': 'With Disabilities.'",
        "'speaker_0': 'Changing the name to the Seattle Disability Commission and requesting that the revised, revised decision is for code accordingly. The committee recommends that they'll pass. Excellent. Thank you, Madam Clerk, because Morales, you are the chair of this committee and I'm going to go ahead and hand the virtual mike over to you so you can walk us through this'",
        "'speaker_0': 'legislation.'",
        "'speaker_3': 'Thank you. Council president. It's pretty simple, really. Amelia sort of caught it. Captured it all. The members of the disability commission have voted unanimously to change the name from the previous people with disabilities. My understanding is that this really reflects a preference for neither a person first orientation.'",
        "'speaker_3': 'In other words, people with disabilities farmer who is blind nor for an identity first orientation or a disabled person, but rather a preference for the commission identifying as the subject matter experts, hence the disability commission. As I said, this was voted on unanimously by the members of the Commission themselves, and so we are recommending passage of the'",
        "'speaker_3': 'bill. And am I supposed to move something up?'",
        "'speaker_0': 'Nope. Nope. We're doing. We're doing just fine. Sorry. I was looking for the mute button there. My apologies for the awkward pause. Okay, colleagues, are there any additional comments on the spill? Or questions for Councilman Morales. Hearing none.'",
        "'speaker_0': 'Will the clerk please call the roll on the passage of the bill?'",
        "'speaker_1': 'Morales. Yes. Macheda. Yes. Peterson.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'What?'",
        "'speaker_3': 'Yes.'",
        "'speaker_1': 'Strauss.'",
        "'speaker_3': 'Yes.'",
        "'speaker_1': 'HERBOLD Yes. Suarez, I.'",
        "'speaker_2': 'Lewis Yes.'",
        "'speaker_1': 'President Gonzalez.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Nine in favor.'",
        "'speaker_0': 'Nine opposed the bill passes and the chair will sign. It will please a fix my signature to the legislation on my behalf. Items three and four. Will the clerk please read items three and four into the record? Agenda items three and four appointments 16, 18 and 1627 appointments of Rebecca Bryant and Avril Charney as members.'"
    ],
    "Adoption and Amendment of Seattle Construction Codes.": [
        "'speaker_0': 'Thank you. The motion carries and the appointments are confirmed. Thank you. Moving on now to the report of the Land Use and Neighborhoods Committee. Will the clerk please read the short title of item 31 into the Record Report of the Land Use and Neighborhoods Committee Agenda Item 31 Council 119992 relating to sales construction codes adopting the Seattle'",
        "'speaker_0': 'Boiler.'",
        "'speaker_1': 'Code Building Code Electrical Code, existing building code, fuel gas.'",
        "'speaker_0': 'Code, mechanical code, planning code and residential code by reference. The committee recommends the bill pass. Thank you, Madam Clerk. I'm going to go ahead and had this over to Councilmember Strauss, who is the chair of this of the committee.'",
        "'speaker_0': 'Please tell us more stress.'",
        "'speaker_3': 'Thank you. Council President. Colleagues, this legislation adopts construction codes, including a new boiler code building code, electrical code, fuel gas code, mechanical code, plumbing code and residential code. As Amelia just noted, this this item in particular does not include the energy code updates, which we will consider in the next agenda item.'",
        "'speaker_3': 'Construction codes are updated every three years, following a process of updating national and state level codes. This update comes to comes at the end of the 2018 construction codes cycle. The changes in this legislation adopt and align with the new state codes and adopt some Seattle specific provisions that go further than the state codes.'",
        "'speaker_3': 'These codes were developed by Department of Construction Inspection and their Technical Code Development Team in consultation with the Construction Code Advisory Board. They were also informed by extensive stakeholder outreach. Code updates are largely technical in nature, but a few highlights of these new codes include establishing standards for cross limited timber structures up to 18 storeys in height'",
        "'speaker_3': ', creating standards for gender neutral toilets. New standards are new standards for tsunami loads in areas that are at risk of tsunami inundation and updating seismic design standards based on modeling. Thank you. Council President. That is the report from the committee.'",
        "'speaker_0': 'Thank you so much, Councilmember Strauss colleagues. Did you want to open it up for any additional comments? Are there any additional comments on the bill? Council members want, please.'",
        "'speaker_3': 'Thank you. And I know items 31 and 32 are. Connected on the building energy grid update. So I will speak to both. I'm happy to vote in favor of these two bills to update Seattle's energy codes for new large buildings to prohibit fossil fuel heaters and boilers.'",
        "'speaker_3': 'Really appreciate everybody who testified today and before in public comment. Carpet developers have proven again and again that capitalism's private market has no interest in stopping climate change. As was mentioned, the latest greenhouse gas emissions report from the Office of Sustainability and the Environment found that rather than reducing emissions, Seattle increased emissions from buildings by 8.1%.'",
        "'speaker_3': 'This is alarming. We know indisputably that we have to end greenhouse gas emissions in order to avoid a global climate catastrophe, endangering every person on the planet, not just slow down emissions and certainly not accelerate emissions like corporate developers have done.'",
        "'speaker_3': 'You would think that since climate change is destroying the planet for everyone, even corporate executives would care about addressing it. But this is the inexorable logic of capitalism. Whatever corporation pursues short term profits most ruthlessly at the cost of ordinary people, humanity and the planet, and is the most successful in shifting its costs to the workers and'",
        "'speaker_3': 'the environment. Those are the corporations with a Darwinian advantage at the expense of all of society. So I very much support this legislation prohibiting those developers from building new fossil fuel burning boilers and heaters in the largest new buildings in Seattle.'",
        "'speaker_3': 'This is a step forward, and it is a testament to the organization's legacy. 50 Sierra Club Climate Solutions and Puget Sound Sage and other organizations which have been campaigning against natural gas hookups for years, including the native activist community.'",
        "'speaker_3': 'It is a substantive step forward, although it is obviously limited. It does not address preexisting buildings, new construction of smaller buildings. And since the dark times on movement one funding to retrofit older buildings, it would not make sense to at the same time continue building new fossil fuel burning infrastructure.'",
        "'speaker_3': 'And most importantly, it does not address how electricity generated in Washington state. Seattle City Lake generates emission free hydropower, largely because of the power plants built during the New Deal almost 100 years ago. So the buildings in Seattle will use clean energy for their electricity, but that is not the end of the story because the light trades'",
        "'speaker_3': 'electricity back and forth with every other utility in the region. Any word that is not used in Seattle is sold to other places on the West Coast. That means that if Seattle uses more electricity with its own energy, you will have more of a market to sell.'",
        "'speaker_3': 'Electricity outside Seattle and Puget Sound Energy burns, fracked natural gas to generate electricity. So in addition to these important bills, we need a full fledged green new deal with green jobs to build clean power plants across the state and across the country, like in the 1930s Green New Deal program.'",
        "'speaker_3': 'Just like we cannot rely on for profit developers to protect the climate when building in Seattle, we cannot trust for profit energy companies like PSC generate our electricity. This is another key reason why I am a socialist and I'm, as I said, I'm happy to vote yes on these legislation.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Silent. Are there any additional comments on the bill? Councilmember Herbert Place You know, I'm not a member of somebody else's committee, but I want to thank them for doing the work necessary to bring this legislation forward together with the work of his committee members.'",
        "'speaker_0': 'When I also give a shout out to former Councilmember Mike O'Brien for spearheading this work at the at the council level, consistent with the activism referenced by Councilmember Salant of organizations like 350 Board.'",
        "'speaker_3': 'And.'",
        "'speaker_0': 'A Green New Deal for Seattle. After we passed a resolution in August 2019 and an executive order working to advance many, many pieces of of of. Regulation that this is, I think, one important part moving forward but has been stated.'",
        "'speaker_0': 'There's a there's a lot to be done in order to reach the goal of significantly reducing carbon emissions to the existing pool of increasing energy efficiency. Of course, as as has been mentioned, we we will need to do more to address the existing buildings as well as to figure out how to.'",
        "'speaker_0': 'Incentivize efficiency of smaller buildings, including single family homes that use natural gas. Heating the Urbanists reports that fossil fuel gas from Puget Sound Energy produces 15% of the city's CO2 emissions in 2018. So I think, again, that really points to the work that we need to do together.'",
        "'speaker_0': 'I also want to highlight that the Council did fund positions in the 2021 budget to move forward the work of the Green New Deal Oversight Committee, look forward to their recommendations and want to again recognize that the advocacy necessary to fund those positions is is advocacy that's coming from the community to hold us accountable and make sure'",
        "'speaker_0': 'that we are charting a path forward. Thank you. Thank you for that. Colleagues. Any other any additional comments on the bill? Hearing no additional comments on the bill. Will the clerk please call the vote on the passage of the bill?'",
        "'speaker_1': 'Morales Yes. Macheda. I, Peterson.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Sir. What?'",
        "'speaker_3': 'Yes. Strauss Yes.'",
        "'speaker_1': 'Herbold Yes. Suarez, I. Lewis.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'President Gonzalez. High nine in favor. None opposed.'",
        "'speaker_0': 'The bill. Check the pill. Excuse me. The bill passes and the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? Okay. Item 32 Will the court please read the short titled item 32 into the record?'"
    ],
    "Adoption and Amendment of Seattle Energy Code and Related Regulations.": [
        "'speaker_0': 'Gin Diamond 32 Constable 119993 related to sales construction code adopting the Chateau Energy Code and chapters of the Washington Administrative Code by reference to committee recommend civil passes amended with Council member Strauss Macheda, Juarez and Lewis and Favre with an abstention from Councilmember Peterson.'",
        "'speaker_0': 'Thank you so much. Madam Clerk, as members Strauss, I want to hand it back over to you to walk us through this committee report.'",
        "'speaker_3': 'Thank you, Council President, colleagues. This is the legislation that adopts the new energy code similar to the construction codes we just considered. This new code adopts state level standards and builds upon them in important ways. This legislation comes soon after the most recent greenhouse gas inventory shows that our city's emissions have been increasing, including an 8.3 increase'",
        "'speaker_3': 'in building emissions between 2016 and 2018. The changes in this legislation will eliminate most carbon emissions resulting from new development and will reduce Seattle's total building emissions by at least 12% by 2050. The main highlight of this new energy code is a prohibition on the use of fossil fuels and electric resistance for space and water heating in'",
        "'speaker_3': 'multi-family and hotel developments, as well as commercial developments for the space heating requirements. These water heating requirements would take effect in 2022 to allow time for the market to adapt. The space heating requirements will take effect on June 1st, 2021.'",
        "'speaker_3': 'After an amendment during our last committee meeting. Other changes in this legislation include restricting the building envelope, heat loss, setting higher standards to reduce energy loss through windows, requiring more efficient HVAC systems in multifamily and medical office buildings, and requiring a lot electrical receptacles in dwelling units to allow for future electric electric appliances.'",
        "'speaker_3': 'As discussed this morning, there was one amendment that passed changing the implementation date of space heating changes. And Councilmember Lewis brought an amendment that would expand the water heating requirements.'",
        "'speaker_2': 'To commercial buildings.'",
        "'speaker_3': 'This will need to be considered as a separate piece of legislation. While these changes reduce our reliance on natural gas, we now rely more heavily on heat pumps, which also use refrigerants that, if not maintained and inspected, also have a great impact on our climate.'",
        "'speaker_3': 'As we transition our society to address the climate crisis, there are people's lives that also must change and making these changes directly change the work of unionized pipe fitters. As I discussed this morning, as we transition to address the climate crisis, we must also ensure this transition is not at the expense of union jobs that provide family'",
        "'speaker_3': 'wage, paid family wages and apprenticeships rather than student debt. As we've already discussed, working with Councilmember Mosquito through the Board of Health to increase and ensure effective inspections of this and other pipes. My work with Councilmember Herbold on the fire code regarding decommissioned fire lines and my work in the future regarding additional structural safety in the next'",
        "'speaker_3': 'round of building codes. With this update, Seattle will now have one of the most forward thinking energy codes in the country, and we will be setting the example that the rest of the state can follow in the next update.'",
        "'speaker_3': 'I especially want to thank Micah Chappelle, Dwayne Johnson, our Delgado, Seattle Department of Construction Inspections for not only helping us understand this complex code. Also doing extensive, extensive outreach to stakeholders and making this extremely effective code. I also want to thank central staff and to all the stakeholders and advocates who participated in this process.'",
        "'speaker_3': 'And finally, I want to reiterate that as we transition our economy to confront the climate crisis, we must be aware that the way we transition will impact people's lives. And we have to ensure that as we transition to address climate crisis, we are also protecting those jobs.'",
        "'speaker_3': 'Thank you. Council President. Thank you. Colleagues, I urge you support.'",
        "'speaker_0': 'Thank you, Councilmember Strauss, for that summary. I see that Councilman Lewis would like to make some comments on here, so I am going to open this up for any additional comments. So again, colleagues, this is an opportunity to make comments on the bill.'",
        "'speaker_0': 'I would encourage you to use the raise your hand feature in Zoom if you are able to if not, just give me a wave or send me a quick message. So first up is Councilmember Lewis and then we'll hear from Councilmember Peterson and then Councilmember Mosquito CASMIR Lewis, please.'",
        "'speaker_2': 'Thank you, Madam President. I just want to reiterate the remarks that I made this morning. Now that we're here, considering the underlying bill and Councilmember Strauss alluded to them about my amendment that I had been pursuing in consultation with stakeholders around expanding this legislation to include certain commercial considerations as well.'",
        "'speaker_2': 'As I said in briefing this morning, for various reasons that was going to slow down the implementation of this legislation. As Councilmember Strauss indicated, we will be pursuing separate legislation to accomplish that goal in a way that won't slow down the rest of the things that are in this bill.'",
        "'speaker_2': 'I think that's a good path forward so we can get this this on the books quickly and start implementing it while we take our time developing the other commercial considerations without slowing the overall implementation down. So I just want to signal I'm fully committed to that for folks that are wondering why that that amendment did not go'",
        "'speaker_2': 'forward. Councilmember Strauss and I are working together on it and we will be introducing legislation to address that.'",
        "'speaker_0': 'Thank you so much, Councilmember Lewis. And again, for those of you using the raise the hand feature, if you can lower your hand after you're done that, that would be helpful. Thank you. Next up is Councilmember Peterson and then Councilmember Mosquito.'",
        "'speaker_2': 'Thank you, Council President and thank you, Chair Strauss, for shepherding this. I support these updates to all of our building codes so that our building codes address the climate crisis regarding the Energy Code bill before us. Now, I just needed more time to research it because we heard from a diversity of views during public comment at committee'",
        "'speaker_2': '. And so I just needed a few extra days to, to look into this and reconcile some of the concerns we were hearing from both labor and others who are actually building these buildings. And I feel it was really about the effective date that had moved around a bit.'",
        "'speaker_2': 'There was a previous stakeholder process and then there was additional input on that. And so I feel more comfortable now having that extra time. And so we'll be voting to support this bill. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Peterson. I appreciate you addressing that, because I was going to one of the questions I was going to ask is if there could be some comment about the abstention so I could get a better understanding of what the committee conversation was.'",
        "'speaker_0': 'So that is you answered my question before I even asked. So I appreciate that. Councilman Muscadet next is next. And then after that will be Councilmember Robles, Councilmember Mosquito. Thank you very much. Madam President, Council colleagues, first, I want to start by thanking the committee.'",
        "'speaker_0': 'You've really led a very transparent process in considering the piece of legislation in front of us. And the deliberations that you have engaged in with various stakeholders have been authentic in wanting to seek feedback and good ideas, ways for improvements and better understanding on the timeline.'",
        "'speaker_0': 'And I just want to applaud you for this work. I know it's been a year that you've been on council and the last year felt like five years. But this is a really historic piece of legislation today. And I want to just thank you for your leadership on this and helping to lead the council in this discussion'",
        "'speaker_0': '. I also want to thank the council members who are part of the committee who supported the amendment that I had the chance to bring forward with support and in consultation with the good chair, Councilmember Strauss and I had a chance to talk about the the timing and the ability to move forward on space heaters and very thankful'",
        "'speaker_0': 'for the committee's work on that. In addition to the environmental justice folks that we heard from today, I talked with members of the building construction trades about the technology and the readiness of the technologies to be able to move forward with space heaters more expeditiously than January of 2022.'",
        "'speaker_0': 'And I think that we landed on a good date with June of 2021 to allow for us to have sufficient time for stakeholder feedback as we develop rules, and also for us to have a better understanding of any potential legislation that the state lawmakers are considering that could have an impact on rulemaking and implementation going forward.'",
        "'speaker_0': 'Obviously, this is really an exciting day as we consider these two pieces of legislation, but I think it's a great example as well of a deliberative process that has included weighing technology that's available with just transition for workers so that there is the ability to recognize that we have to strike a balance between labor partners and the'",
        "'speaker_0': 'right timing to respond and shift work from natural gas to refrigerant pipes and doing so in a way that ensures address transit transition for workers is really critical. So very happy to be working with all of you as we continue to center that balance in all of the discussions that we have.'",
        "'speaker_0': 'Recognizing that the buildings that we've built for today, they're going to last for generations, hopefully, hopefully much longer than that once the average. But if you look at the Pioneer Square buildings from downtown and across our city, we want the buildings that are going up today to truly help build a better and healthier future for our region'",
        "'speaker_0': 'and our world. So I think that we're doing an important part of that today. It's all part of the bigger puzzle that was discussed this morning. I also want to recognize some of the concerns that we've heard today and also in testimony over the last few weeks from some who have been calling in about concerns regarding the'",
        "'speaker_0': 'sprinkler requirements, recognizing that both local housing providers and the Master Builders Association are talking about townhomes and projects with less than four units. What I hope to do is to continue to build on some of the recommendations that we have seen and are hoping to see come forward in a major comprehensive plan.'",
        "'speaker_0': 'Update I fully support allowing more duplexes and triplexes, particularly for Flex six plus those on various sites. As we think about creating opportunities for folks who have mixed income housing options, multi-generational housing options, denser housing options across our city, I think that there's a lot of common ground there.'",
        "'speaker_0': 'And when we think about costs and trying to weigh the cost of potential changes that we're making today, what's clear, I think, in our conversations with various members of the community is that land is the most expensive thing.'",
        "'speaker_0': 'And when it comes to creating more housing in our city, we have to make sure that we're allowing for more homes to be built on the precious land within the city's boundaries. So let's continue to work together. Let's reduce the cost of building homes that we so desperately need.'",
        "'speaker_0': 'And let's move forward with some of those areas where I think there's a lot of alignment on the major comprehensive plan. UPDATE That's soon to come with that. Again, thank you, Mr. Chair, for your leadership on this. Looking forward to voting.'",
        "'speaker_0': 'Yes, and thanks again for the support on the balanced amendment that we were able to include last week. Appreciate it. Thank you, Councilmember Mosqueda. Next up is Councilmember Herbold. Thank you. Just very, very quickly, I want to mention that since it has been mentioned a couple of times as it relates to the the sprinkler regulations for for'",
        "'speaker_0': 'townhomes, that change is.'",
        "'speaker_1': 'Specifically.'",
        "'speaker_0': 'Contained in the construction code bill before us. But because the fire department will be coming to my committee next week to talk about fire code changes, we are also going to have an opportunity to have a conversation about the the requirements for sprinklers in townhomes.'",
        "'speaker_0': 'So just wanting.'",
        "'speaker_3': 'To let folks know that that will be that that.'",
        "'speaker_0': 'Topic will be coming for discussion in my committee next week. Thank you. Thank you. Councilmember Herbold, colleagues. Any additional comments on the bill? It looks like there are no additional comments on the bill. I want to echo my thanks to you, Councilmember Strauss, the chair of our Land Use and Neighborhoods Committee, for doing great work on this'",
        "'speaker_0': 'legislation and making sure that it is balanced as smoothly as it did. So thanks so much, Councilmember Strauss, for all of the hard work in your in your committee. And thanks to all of the committee members for. I'm sure what was robust engagement on the underlying policy issue.'",
        "'speaker_0': 'Councilmember Strauss. I do want to make sure that you have an opportunity to have the last word as the sponsor and chair of this committee before we call this matter to a roll call.'",
        "'speaker_3': 'Thank yeah, thank you. And thank you, colleagues, for all of your kind words. This was really a group effort. And again, the kudos should be directed to Mike Chappelle, Dwayne Johnson, Adele, Georgia, all the folks over at Stsci Central staff and my committee director, Noah.'",
        "'speaker_3': 'So thank you all.'",
        "'speaker_2': 'For your great work.'",
        "'speaker_3': 'This is a group effort and.'",
        "'speaker_2': 'I'm just one person. Thank you all.'",
        "'speaker_0': 'Thank you, Councilmember Stress. All right. With that being said, will the clerk please call the roll on the passage of the bill?'",
        "'speaker_1': 'Morales Yes.'",
        "'speaker_0': 'Macheda I.'",
        "'speaker_2': 'Peterson Yes.'",
        "'speaker_1': 'So what?'",
        "'speaker_3': 'Yes. Strauss Yes.'",
        "'speaker_1': 'Herbold Yes. Juarez, I.'",
        "'speaker_2': 'Lewis Yes.'",
        "'speaker_1': 'President Gonzalez High nine in favor. Nine opposed.'",
        "'speaker_0': 'The bill passes and the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? Okay. We have item 33 next. Will the clerk please read the short title of item 33 into the record?'"
    ],
    "Extension of Contract Rezone for 1106 34th Avenue.": [
        "'speaker_0': 'Agenda item 33 Clerk File 314461. Application of Martin Liebowitz and 34th and Spring LLC for an extension of a contract for use out of the property located at 1106 34th Avenue. The committee recommends that the application be granted.'",
        "'speaker_0': 'Thank you so much. And I hand it back over to Councilmember Strauss to walk us through this application and the related clerk. Clerk file.'",
        "'speaker_3': 'It counts. Thank you. Counts president and colleagues. The next two items are are going to be taken together. The first is a clerk file and then the following is a council bill, all regarding a contract rezoning of 1106 34th Avenue.'",
        "'speaker_3': 'This is a bit of a different process than usual because this is an extension of an existing contract reason. So in 2017, the Council approved an application for a contract free zone of 1106 34th Avenue in Midtown, up from low rise to two neighborhood commercial, one with a 30 foot height limit.'",
        "'speaker_3': 'In the intervening time, the reason application was not paired with any proposal to develop the site, and the property owner has been unable to find a developer, a development partner during the pandemic and has applied for a two year extension of this rezone.'",
        "'speaker_3': 'The Lands and Neighborhoods Committee held a public hearing on this application in December. Seattle Department of Construction Inspections has recommended approving the application based on the impact of the pandemic, on the real estate industry, and on changed circumstances resulting from the passage of meant for housing affordability, which increased density in the surrounding area.'",
        "'speaker_3': 'This Clarksville file contains the application itself. If the application is approved, then Council Bill 119987 effectuate the extension and adopts the new property use and development agreement. Thank you, counsel present. That is the report of the committee on this Court file.'",
        "'speaker_0': 'Thank you so much, Councilmember Strauss, are there any additional comments on the application? Hearing on the CLARK Please call the role on granting the application.'",
        "'speaker_1': 'Morales Yes. Macheda.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Peterson.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Sir. What?'",
        "'speaker_3': 'Yes.'",
        "'speaker_1': 'Strauss.'",
        "'speaker_3': 'Yes.'",
        "'speaker_1': 'Herbold.'",
        "'speaker_4': 'Yes.'",
        "'speaker_1': 'Suarez I.'",
        "'speaker_2': 'Lewis yes.'",
        "'speaker_1': 'President Gonzalez.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Nine in favor and unopposed.'"
    ],
    "Extension and Amendment of Contract Rezone for 1106 34th Avenue.": [
        "'speaker_0': 'Thank you so much. The motion carries and the application is granted. Item 34 Will the court please read the short title of item 34 into the record? Agenda item 34 accountable 119987. Approving the extension of a contract present to prevent ordinance 125433 and accepting an amended Probation Department agreement.'",
        "'speaker_0': 'The committee recommends that the bill pass. Thank you, Madam Clerk. I'm going to hand it back over to Councilmember Strauss, who I understand has a substitute for us to consider. So I'm going to hand it over to him to make that motion.'",
        "'speaker_3': 'Council president colleagues, this is the corresponding council bill for the contract Arizona has just discussed. Before we consider the underlying council bill, I will move to substitute a new property use and development agreement, as is routine.'",
        "'speaker_2': 'For these contract reasons.'",
        "'speaker_3': 'And so therefore I move to amend Council Bill 119987 Exhibit A by substituting the executed amended property use and development agreement with the executed amended.'",
        "'speaker_2': 'Property use and Development Agreement.'",
        "'speaker_0': 'Thank you for that motion. Is there a second? Second. Thank you so much. It's been moved in. Second is are there any additional comments on the substitute? And Councilmember Strauss, I'll hand it back over to you in case you want to add anything else to this report.'",
        "'speaker_3': 'No further comments at this time. Thank you, colleagues.'",
        "'speaker_0': 'Any additional comments? Colleagues. Hearing and seeing none. Will the court please call the roll on the adoption of the substitute to exhibit A?'",
        "'speaker_1': 'Morales. Yes. Must get a.'",
        "'speaker_0': 'Yes.'",
        "'speaker_2': 'Peterson Yes.'",
        "'speaker_1': 'So what?'",
        "'speaker_3': 'Yes. Strauss Yes.'",
        "'speaker_0': 'HERBOLD Yes.'",
        "'speaker_1': 'SUAREZ Hi.'",
        "'speaker_2': 'Lewis Yes.'",
        "'speaker_1': 'President Gonzalez I nine in favor and unopposed.'",
        "'speaker_0': 'The motion carries the.'",
        "'speaker_1': 'Oh, no.'",
        "'speaker_3': 'Council president. You went on mute on accident.'",
        "'speaker_0': 'Here. I was thinking I was on such an elegant roll. Okay, motion carries. The substitute is adopted and the amended bill is before the council. Are there any additional comments on the amended bill? Hearing no additional comments on the amended bill.'",
        "'speaker_0': 'Will the clerk please call the roll on the passage of the amended bill?'",
        "'speaker_1': 'Morales Yes. Macheda I.'",
        "'speaker_2': 'Peterson Yes.'",
        "'speaker_1': 'Sir. What? Yes. Strauss.'",
        "'speaker_3': 'Yes.'",
        "'speaker_1': 'Herbold. Council member, Herbold.'",
        "'speaker_0': 'Is working on it. I see a nod and I see I see her searching for that mute button. All right, here we go.'",
        "'speaker_1': 'Revolt.'",
        "'speaker_3': 'Yes.'",
        "'speaker_1': 'Suarez i. Lewis?'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'President Gonzalez.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Nine in favor and unopposed.'",
        "'speaker_0': 'The bill passes as amended and the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? All right, folks, we're getting into the homestretch here. Next up is committee report of the Select Committee on Homelessness Strategies and Investments.'"
    ],
    "Sponsorship of King County Regional Homelessness Authority's Membership Application.": [
        "'speaker_0': 'Will the court please read item 35 into the record? The committee report on the Select Committee on Homelessness Strategies and Investments Agenda Item 35 Resolution 31987 Sponsoring the King County Regional Homelessness Authority's Application for membership to dissociation of Washington Cities Risk Management Service Agency.'",
        "'speaker_0': 'The committee recommends that the resolution be adopted. Thank you, Madam Clerk. Councilmember Lewis, I'm going to hand it over to you to walk us through the committee report.'",
        "'speaker_2': 'Thank you, Madam President. As I mentioned during a briefing today, County Regional Homelessness Authority is applying for the Washington Association Cities Risk Management Pool. This requires a a sponsor, a sponsoring member to bring that forward. We are doing so here in this very short one page resolution.'",
        "'speaker_2': 'And I, with those comments, do move resolution 31987.'",
        "'speaker_0': 'Thank you so much. Colleagues, are there any additional comments on this resolution? Okay. Hearing none. I know we did have an opportunity to have a conversation about the resolution during the full committee. The select committee hearing, which is a committee of the halls, appreciate an opportunity to take the final vote in today's full council hearing.'",
        "'speaker_0': 'No additional comments on the resolution. Will the clerk please call the roll on the adoption of the resolution?'",
        "'speaker_2': 'Morales I don't.'",
        "'speaker_0': 'I'm, I'm.'",
        "'speaker_2': 'I don't know if my motion was my motion seconded. Just wondering procedurally. Just want to make sure.'",
        "'speaker_0': 'There, there. There is no need to make a motion. We just have to describe what the resolution is and then have a debate. And then we can go ahead and call the roll.'",
        "'speaker_2': 'Perfect. Well, sorry for interrupting everything. That.'",
        "'speaker_0': 'And that's all right. That's all right. Is there anything else you wanted to say about the resolution?'",
        "'speaker_2': 'No. God, no. Okay.'",
        "'speaker_0': 'All right, folks. So it's a wacky Monday. I get it. Okay, we've got a roll on the adoption of the resolution.'",
        "'speaker_1': 'Morales.'",
        "'speaker_0': 'I mosquera i.'",
        "'speaker_1': 'Peterson, i so one.'",
        "'speaker_3': 'Yes.'",
        "'speaker_2': 'Strouse, yes.'",
        "'speaker_1': 'Herbold.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Suarez. Hi, Lewis.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'President Gonzalez. Hi. Nine In favor and unopposed.'",
        "'speaker_0': 'The resolution is adopted and the chair will sign. It will occur. Please affix my signature to the legislation on my behalf. Whoever says we can't have fun while governing is obviously wrong. All right. We're going to head over now to our last committee report, which is the sustainability and Renter's Rights Committee.'",
        "'speaker_0': 'And hold on a minute. I know we have a revised script here in light of some late breaking news. See that? Okay. I'm going to go ahead and have the clerk read items 36 through 38 into the record, and then I'll walk folks through some procedural changes that will need to happen in this section.'"
    ]
}